{"content":"<p>I've been writing software in some form or another for quite a while now and it's interesting to see how my workflow has changed - intentionally and not - as I've progressed with my development knowledge. I really try to make a point of occasionally re-visiting my process of writing software to see where I can improve, if any of my habits are outdated, and various things like that. It's pretty crazy to realize I started writing software just about five years ago, not long after I adopted Linux as my main operating system and there's been a lot of fairly substantial changes that I basically just took in stride.<\/p>\r\n\r\n<p>Lately, I've been on a push to more formally track what I do, when I do it, and what I spend my time on while putting together and maintaining the number of applications I've written and in many cases use. Adding version control to my routine was a no-brainer once I learned more about it and its purposes a couple years ago, although it was only recently that I finally put together some scripts and pushed all of my code to Git. I've also used csv, but I found it was somewhat more irritating to use since at the time I didn't have good resources to use it to its potential. Since then, my development process has been a lot more organized since I made a point to clean out all my various folders and consolidate them into Git repositories on my server. Definitely nothing bad resulted from that.<\/p>\r\n\r\n<p>Recently, after having used version control for some time, I realized I didn't have a good way to track how much time I put into various projects. I track my running and sleep and I love crunching data to see where I spend my time so I can plan my day accordingly, so tracking my development seemed like a logical next step. It took me a couple months to pull myself together and get serious about finding (or building) an application to suit what I wanted to do between school and work taking up a substantial portion of my time. I have used time tracking applications in the past that I just didn't like and I wasn't willing to put a lot of time getting them up and running so it was a little bit of an uphill battle to change my habits. In the end, I finally pushed myself to write my own application for the purpose which does exactly what I need it to.<\/p>\r\n\r\n<p>Changing my habits to log my time was much less painful than I anticipated. Even as I was watching the clock putting together my time tracking application, I had images of myself quickly abandoning the process as I sat down informally to hammer out a few more lines of code here and there throughout the day without glancing at the clock. Part of it is likely that little burst of pride you get when you actually use your own application and it works, but I've found it's not actually that much of a pain to do. I shoot a look at the clock when I start, again when I'm done with the task I embarked on, log a close estimate of the time rounding minutes off here and there when I can get away with it (not for work, obviously), and continue on with my day.<\/p>\r\n\r\n<p>I've found that knowing how much time I spend is actually really interesting, and beneficial from a planning standpoint because it gives me a much better basis for determining how fast I write code, how much time I spend maintaining code, and such like that. The Python application I built for the purpose isn't fully capable of giving me all the statistics that I would like, but now that I'm using it religiously I'll probably push to get that in (logging the time, of course!).<\/p>\r\n\r\n","title":"Workflow Updates","date":null,"tags":"workflow","datestamp":"2013-06-30T20:32:44-05:00","updated":"2013-06-30T20:32:44-05:00"}