{"content":"<p>I really need to get around to implementing support for multiple posts for each date on here. Anyways.<\/p>\r\n\r\n<p>I got back from being out of town and offline for a week, and figured it would be as good a time as any to upgrade my Arch install since I haven't done that for a while. Checked the Arch news, and figured I was good to go so I let the upgrade roll then came back later and without thinking, rebooted. Bad idea.<\/p>\r\n\r\n<p>Apparently, the Arch devs decided to push out an upgrade for my bootloader. I use GRUB legacy which I'm aware is pretty ancient at this point, but it works without a problem so I haven't felt any particular drive to upgrade to GRUB 2 or find something newer. I use GRUB 2 on a couple of virtual machines and Syslinux on another which is fine, but I usually leave my bootloader alone once I have things up and running if I'm not having any problems with it. Something went wrong with the upgrade however and I was left with a borked GRUB 2 install that would just drop me to the GRUB console when I powered up my system, and even from the shell I wasn't able to pull things back together.<\/p>\r\n\r\n<p>I ended up pulling out a flash drive to make a live disk to boot from (though I'd beaten myself to the punch so the flash drive already had a live Arch image on it) and chrooting in. It looked like GRUB 2 didn't generate a valid configuration for itself when it installed, but I wasn't willing to wrestle with it and get it up and working, so I chrooted in and downgraded back to legacy GRUB. I'm all for having the latest and greatest and I like GRUB 2, but given my experience upgrading to it, it's more trouble than it's worth to actually run through an upgrade.<p>\r\n\r\n<p>So, lesson learned (yet again), keep track of what I'm doing and make sure everything updated correctly before rebooting for any reason. Even the Archwiki says (at the time of my writing) that there isn't really any reason to go through the steps to upgrade legacy GRUB if it works fine so I'm really curious to know the reason for the sudden push to upgrade. Regardless, a little warning would have been nice. For now, it looks like I'll probably blacklist the upgrade in Pacman until I find a compelling reason to upgrade from legacy GRUB. It really doesn't make my day when I get dropped to a GRUB shell when I try to boot my system.<\/p>","title":"Don't Touch My Bootloader!","date":null,"tags":"linux, updates","datestamp":"2013-06-30T12:10:37-05:00","updated":"2013-06-30T12:10:37-05:00"}