{"content":"<p>There's something refreshing about cleanly reinstalling your operating system. I do it periodically for that new operating system smell (it's like the new car smell, just more computery). With the amount of tweaking and tinkering I do, I eventually lose track of what I've changed and why I've changed it and after some time and updates I start having some problems. This time, notably, was issues with my sound card.<\/p>\r\n\r\n<p>The sound issues weren't particularly new although they were somewhat worrying and I was concerned they might be an issue with my hardware. The only piece of software that was able to use my microphone was Google Hangouts for some odd reason, but as Hangouts are my main means of video\/audio chat it wasn't a huge deal. This evolved into a much larger problem when I decided to take KDE out for a spin. KDE is on my list of desktops that I'm not so much a fan of, but it is shiny and definitely much improved from KDE 4.0 so I periodically give it another go. It's always kind of an interesting ordeal because I'm accustomed to a GTK based environment so I end up finding hackish ways to deal with making GTK apps look alright in a QT environment. This time I settled on running the XFCE settings daemon behind the scenes because I already had it and I didn't notice a marked change in performance with it running behind KDE.<\/p>\r\n\r\n<p>This is where the fun began. At some point, I had swapped a few keys around on my keyboard while using XFCE as an experiment and left it, then switched to the Cinnamon desktop which I liked better. I was trying out KDE from Cinnamon because Cinnamon was having some interesting rendering\/sound issues of its own. I remember wrestling with my setup to get XFCE to load my customized keys on login and I couldn't figure out what I'd changed. It got even more fun when I tried to flip over to Cinnamon at one point and Cinnamon wouldn't load. Then came the sound card fiasco. PulseAudio simply didn't start about half the time I logged in, so I had no sound. Generally I was able to manually start it and it was fine, but the other times I needed to repeatedly reboot until my sound cards got recognized. As fast as I had Arch booting, it was a pain. KDE eventually started informing me that various sound hardware had gotten removed when it came up, and the final straw was when it informed me that all seven of my hardware sound devices had been removed (I only have four).<\/p>\r\n\r\n<p>Now, the nice thing with Linux is that to reset your settings, it's as simple as clearing your home directory, logging out, then logging back in. Unfortunately, I tweak a lot of things on the system level so that wasn't where the problem was to be found and at that point, it's easier to just reinstall. I backed up my drive overnight and looked around at the linux disks I had laying around. I enjoy Arch so I was definitely going with something Arch-based (although I am also a fan of Debian and looked at a few Debian-based ones as well. Had I known there was a Debian spin of Mint I might have gone that way). I had an Arch disk as well, but I wasn't really in the mood to rebuild Arch from scratch, I needed my system to be up and ready to go right away for work.<\/p>\r\n\r\n<p>I ended up installing Antergos, which is essentially a preconfigured Arch. Having been playing with Antergos in a VM for a while, I can also say that Antergos's default setup is essentially the same as what I end up configuring Arch into so it seemed like a good choice. Other than my Internet which has been in the toilet, it went smoothly and took about an hour and a half (most of which was downloading packages). I went with a totally new desktop in addition to my (semi) new distro and thus far I've been happy. All of my sound devices now work as they're supposed to, my keyboard layout is correct, and all is well. And I am finally off of GRUB 0.97, so no more worrying about that update getting thrown at me and breaking things again.<\/p>","title":"Clean Install, Clean Settings","date":null,"tags":"linux, updates","datestamp":"2013-08-13T12:01:42-05:00","updated":"2013-08-13T12:01:42-05:00"}