{
    "date": "July 29, 2009",
    "content": [
        "<p><a onblur=\"try {parent.deselectBloggerImageGracefully();} catch(e) {}\" href=\"http://www.webdesign-guru.co.uk/icon/wp-content/uploads/phone-button.jpg\"><img style=\"margin: 0pt 0pt 10px 10px; float: right; cursor: pointer; width: 166px; height: 166px;\" src=\"http://www.webdesign-guru.co.uk/icon/wp-content/uploads/phone-button.jpg\" alt=\"\" border=\"0\" /></a><br />Mobile technology doesn't only exist, it's become life for an increasing number of people.  Texting allows the online world to be extended beyond the computer, so one is always connected to friends and online.  However, there are some downsides to this type of lifestyle that come in many forms and factor in a lot of different places.  First and foremost is security.<br /><br />In theory, mobile technology is more convenient and more secure than things that are connected to the Internet via a direct route, because they are much more difficult to infect with viruses and to hack (though be aware there are viruses for mobile phones and other devices out there).  Each online account would be tied to a phone, and that's carried on one's person.<br /><br />In practice, however, things don't work quite like that, due to the simple fact of human nature.<br /><ul><li>Mobile devices are small (and getting smaller) and so are fairly easy to misplace.  Online accounts tied to such a device are instantly compromised as soon as the phone is picked up by any nosy person.</li><li>Complex passwords take longer to type from a phone or most other mobile keypads.  In order to have the most convenience, many people will simplify their password to something less secure that they can type faster.  My phone has no Internet access and my WiFi capable device has a really, for lack of a better word, crappy keyboard that's nearly unusable.</li><li>Generally, all of a person's contacts are stored in their phone, obviously because it's much easier to select a phonebook entry than to remember a million numbers.  A compromised phone gives easy access to all those numbers (and whoever those numbers belong to will assume it's you).</li><li>Let's face it, very few dedicated phones have decent built-in security (and neither do a lot of smartphones, to be honest).  Most phones have a \"diagnostics code\" that is the same between each phone made by the same company and takes precedence over the user's security code.  Thought your code would keep people out, eh?</li></ul>So far, there's no fail-safe way to prevent a lot of the security issues that arise with many mobile devices.  Until such devices get more complex and producers realise that security will become a significant problem, no real improvements will happen unless human nature itself changes.  Until then, there are some simple ways to stay safer:<br /><ul><li>Don't open links in SMS (text) messages unless you know what they are</li><li>Don't open or answer messages or calls that are unfamiliar<br /></li><li>Do set a security code- it keeps out the casual intruder (though be aware it's nothing to a hacker)</li><li>Keep track of your phone (harder than it sounds when you've got shallow pockets)</li><li>Know what sites are attached to your phone so if the worst happens, you can close things up before anything too bad happens</li><li>Get the word out fast if you lose your phone and have it deactivated if your provider allows it</li></ul>From what I know, there's currently not a significant threat virus and software-wise to most mobile devices.  However, that's not to say that there is NO threat- a virus was discovered for a specific brand of phones fairly recently.  Once there is a true threat, simply keep up with the latest software, providing you have an updatable phone, or take precautions to stay safe, such as those listed above.<br /><br />Stay tuned for Part 2 of The Downsides to Mobile Life, coming next week!\n</p>\n"
    ],
    "title": "The Downsides to Mobile Life: Part 1- Security",
    "datestamp": "2009-07-29T21:11:00-05:00",
    "tags": "communications, internet, life, safety, security"
}