{
    "content": [
        "<p><a href=\"http://lh5.ggpht.com/__BBcPvPuMhA/SxrgVu2MK9I/AAAAAAAAAIw/IWv9XFqU2vI/person.png\" imageanchor=\"1\" style=\"clear: right; float: right; margin-bottom: 1em; margin-left: 1em;\"><img border=\"0\" src=\"http://lh5.ggpht.com/__BBcPvPuMhA/SxrgVu2MK9I/AAAAAAAAAIw/IWv9XFqU2vI/person.png\" /></a>\n</p>\n",
        "<p>As most of us know, the Internet isn't based in a single country, it's global.  Major web companies such as Yahoo and Google have servers based around the globe.  In order to maintain their services and to provide a fair amount of reliability, they store information across multiple servers.\n</p>\n",
        "<p>Any online information, once publicized to any degree is out of the control of its owner- contact information can be managed by any number of sites, for example.  With regards to physical location, many users of online services don't have a perception of what happens to the information they upload.  The Cloud seems magical to end users but there are real, physical locations and hardware that keep it running.\n</p>\n",
        "<p>Most services keep information stored geographically as close to users as possible- Google's GMail went down a while back due to an issue with that and Yahoo once offered to move my data to Australia (Opera Mobile uses a proxy service most likely based there).  I personally store a massive amount of information online- Skydrive and Mesh have my photos and writing, Google has my email, documents, and contact information, Facebook has photos and personal information, and Chi.mp stores all of my contact information.\n</p>\n",
        "<p>Skydrive backs up information to other servers, so copies of my photos could be residing somewhere overseas- I could be visiting Europe and not even know it.  As for Chi.mp, their service is based in the Northern Mariana Islands- but they run off of Amazon's cloud service wherever that may be.\n</p>\n",
        "<p>From a global perspective, it is really very difficult to determine where the information you store online truly flies off to.\n</p>\n",
        "<p>The question becomes, however, is if it's really significant to know physically where your online information is stored- as long as its owners can access and edit it as needed.  The days of keeping track of where all your information is are over; it's the cyber age so it can be anywhere.  Want proof?  Search for yourself on <a href=\"http://whitepages.com/\">http://whitepages.com</a>.\n</p>\n"
    ],
    "date": "December 16, 2009",
    "title": "Where on Earth is your data?",
    "datestamp": "2009-12-16T19:57:00-05:00",
    "tags": "computer, data, internet, life, privacy"
}