{
    "datestamp": "2009-10-21T21:05:00-05:00",
    "content": [
        "<p><a href=\"http://farm4.static.flickr.com/3633/3400695010_322d20e9cc.jpg?v=0\" imageanchor=\"1\" style=\"clear: right; float: right; margin-bottom: 1em; margin-left: 1em;\"><img border=\"0\" height=\"79\" src=\"http://farm4.static.flickr.com/3633/3400695010_322d20e9cc.jpg?v=0\" width=\"280\" /></a><a href=\"http://chi.mp/\">Chi.mp</a> is my current OpenID provider and I plan to stick with it as it is extremely full featured and under active development.  The only downside to it is really that it has so many features that it takes a while to learn all of them, but they are easily accessable and easy to navigate.  Here's the features;<br />\n</p>\n",
        "<p><ul><li><b>A personal URL.  </b>Yes, you heard it, you get your own designated URL for free, yourname.mp.  This in itself is very nice because it gives it a more personal feel and a more professional look, if that's what you're going for.  They have a deal with a web hosting company- therefore you can also find some web hosting features here as well. </li>\n</p>\n",
        "<p><li><b>Your own website.</b>  Chi.mp isn't so much a website as a personal content hub.  You get a full web page all to yourself that you can theme to your liking, though currently you can only do colors and background images- layout is coming soon (there is no coding, it's all graphical).  While Chi.mp itself does provide a small blog, you can pull in any number of feeds from other sites, such as Twitter, Blogs, Facebook, and anything else providing an Atom or RSS feed.  These show up on your site- and you can select who can see what (more on that in the multiple personas).</li>\n</p>\n",
        "<p><li><b>Multiple Identities.  </b>Chi.mp is not your usual social networking site- its focus is on permissions and privacy.  You set up multiple identities for giving information to sites you sign up for with your OpenID, but these are also used to set permissions to your friends.  You have a public profile that is visible to the world, but friends can visit your site and log in with an OpenID- from there you set what Identity you want them to see, which allows and restricts contact information and content they can see.  You can even set different themes, avatars, fave icons, and bios to separate identities.<br />\n</p>\n",
        "<p></li>\n</p>\n",
        "<p><li><b>Tracking.  </b>I haven't seen this in too many providers, but Chi.mp allows you to add Google Analytics tracking to your page to track visits, which is nice.</li>\n</p>\n",
        "<p><li><b>Contacts.  </b>Chi.mp provides a powerful contact management system.  It allows you to import contacts from many different sites, like you can do with the feeds.  From there you can merge contacts, which you will most likely need to do if you import from multiple places, assign to identities, and download as a vCard.</li>\n</p>\n",
        "<p><li><b>Networking.  </b>Chi.mp allows you to push status updates to both Twitter and Facebook at the moment, selectively.  Also, you can have a name@yourname.mp email address, which forwards to your main inbox- also a plus for looking professional.</li>\n</p>\n",
        "<p></ul>Chi.mp URLs are very simple- mine is <a href=\"http://natel.mp/\">http://NateL.mp </a>.  Given the features this is my favorite provider.  The developers are also very involved with users so if there is a feature you'd like to see you can request it and they will consider it.\n</p>\n"
    ],
    "title": "Reviews of OpenID: Chi.mp",
    "date": "October 21, 2009",
    "tags": "internet, security, social networking"
}