{
    "content": [
        "<p><a href=\"http://1.bp.blogspot.com/-PSTV5yZpLzM/SxrbdyL07KI/AAAAAAAAAIg/RpSaCqphs_Y/s1600/padlock.png\" imageanchor=\"1\" style=\"clear: right; float: right; margin-bottom: 1em; margin-left: 1em;\"><img border=\"0\" src=\"http://1.bp.blogspot.com/-PSTV5yZpLzM/SxrbdyL07KI/AAAAAAAAAIg/RpSaCqphs_Y/s1600/padlock.png\" /></a>\n</p>\n",
        "<p><a href=\"http://commons.wikimedia.org/w/thumb.php?f=Contact-new.svg&amp;width=500px\" imageanchor=\"1\" style=\"clear: right; float: right; margin-bottom: 1em; margin-left: 1em;\"></a>\n</p>\n",
        "<p>In the online world, privacy is surprisingly difficult to come by  because once online, data becomes free game to anyone or anything that  has access to it.  In day to day life, very little thought is devoted to  the fate of anything posted online such as where it goes and to a large  degree, who can access it, generally due to the false assumption that  in the online world, data solidly stays only where it has been posted.   Even in my own experience, I find that Googling myself brings me to  things I've shared online on sites I didn't even know existed.\n</p>\n",
        "<p>In my situation, there isn't any particular problem, as everything I  can find about me I have intentionally published in some form or  another, be it on <i>The Philosophy of Nate</i> or elsewhere.  However,  having an idea of where other parts of my identity are floating around  the Internet is much scarier, mainly because I have no idea where it may  be, public or not.  One of my email addresses, for example, has  suddenly started receiving massive amounts of spam; I don't know how it  became available to the companies that deliver junk email.  However, I  do know that any number of my friends have access to one or more of my  email addresses, be it on their computer, webmail, their phone, or  otherwise.  <b>There is a huge number of contact-management sites, each  with their own privacy policy, any of which could have my contact  information.<i>  </i></b>I don't know who I interact with that may use one or more of them for email, instant messaging, or otherwise.  I do know that <i>I</i>  store everything from screen names to phone numbers in my online  contact list because I email, text, and make phone calls through the  same services.\n</p>\n",
        "<p>That aside, <b>there are \"people finder\" sites that aggregate information about people online.</b>   Whitepages.com, for example, has a name search that can bring up  everything from family members to physical address to phone numbers  about anyone over the age of 18.  The information doesn't need to have  been publically posted online to be captured by the site.\n</p>\n",
        "<p><b>Geographically, information is spread farther than many of us will travel in our lives.</b>   Nearly all online services back up their servers to remote sites,  inside or outside of the country.  I know that at one point, Opera used a  proxy service in Australia to serve websites to users of Opera Mini;  Yahoo once asked me if they should migrate my information to their  \"local Australian servers\" for \"better performance.\"  I have never been  to Australia and likely won't visit there for the forseeable future, but  it raises an interesting question, of where on the globe our online  information actually is, especially in the case of those who store a  significant amount of data on the Internet.  Thanks to the Internet, it  can not only be shared (and found) publically or otherwise, but it can  also be anywhere on the planet; hopefully in the case of websites,  securely, but often in the case of our friends' computers and phones,  much less so.\n</p>\n"
    ],
    "title": "Do you know where you are?",
    "date": "October 14, 2009",
    "datestamp": "2009-10-14T19:24:00-05:00",
    "tags": "internet, privacy, safety, social networking"
}