{
    "title": "Google Voice: Turn-ons and Hang-ups",
    "content": [
        "<p><a href=\"http://lh5.ggpht.com/__BBcPvPuMhA/Sxrh_jOkWaI/AAAAAAAAAI4/munytLaTHEk/googlevoice.jpg\" imageanchor=\"1\" style=\"clear: right; float: right; margin-bottom: 1em; margin-left: 1em;\"><img border=\"0\" src=\"http://lh5.ggpht.com/__BBcPvPuMhA/Sxrh_jOkWaI/AAAAAAAAAI4/munytLaTHEk/googlevoice.jpg\" /></a>\n</p>\n",
        "<p>Among the latest buzz on the Internet is Google Voice, Google's newest service that's still in the labs- Google Labs, to be exact.  (<a href=\"http://google.com/voice\">http://google.com/voic</a><a href=\"http://google.com/voice\">e</a> for more information).  As of right now, the service is still invite-only and invites can be requested from Google.  I recieved my invite recently and attached my cell phone to the service and am very satisfied as it comes with a lot of features that, in the opinion of a few friends of mine, should be features of cell phones by default (and to be honest I'm in agreement with them).  I should add, however, that Google Voice does NOT replace a phone company as all it does is call-routing so don't run out and cancel your current phone service.\n</p>\n",
        "<p>The biggest turn-ons are some really great features with the service:\n</p>\n",
        "<p><ul><li>Ring scheduling.  This feature allows a user to set rules of what times a specific phone is NOT allowed to ring (and if it's the only phone attached to GV (Google Voice), then all calls will go straight to voicemail).  This allows for one to potentially eliminate all those late-night calls.</li>\n</p>\n",
        "<p><li>\"Call Presentation\" as Google calls it.  When a call goes to GV if the caller is not known, they are required to state their name and GV will then contact the user, play back the recorded name, then ask what to do (essentially phone anti-spam and yes, this can be turned off).  For those on one's contact list there is the option to have GV contact you and ask what to do (sent to voicemail, answer, etc).  Essentially it's the same idea but it gives you the option to really effectively screen calls.</li>\n</p>\n",
        "<p><li>Online SMS (text messaging for those who don't know what SMS is).  This feature enables you to send messages from your google number to your contacts using your computer or any Internet-enabled device using their online Interface.  The great part of this is that it allows you to converse back and forth using SMS without paying for it on your mobile phone.  It also organises messages very similarly to the way that Gmail does with its conversations.</li>\n</p>\n",
        "<p><li>Blocking callers.  Though some mobile devices do this, most, to my knowledge, do not.  This feature answers calls from blocked callers with stating that the phone number they are trying to reach does not exist.</li>\n</p>\n",
        "<p></ul>Of course, there are more features than just those I listed here.  These are the ones that have probably had the most impact on my phone usage (and that I've actually used).  Amazingly, using Google Voice I've been using less airtime on my phone than before which is a huge advantage for those who pay for airtime on prepaid or other plans.  I personally have a TracFone.\n</p>\n",
        "<p>As with anything though, there are the obvious hang-ups.  However, since Google is actively developing Google Voice (or so I gather) some of these may change as time goes on.  In any case, here they are:\n</p>\n",
        "<p><ul><li>Online SMS shows online AND forwards to the phone.  This is one of the quirks that has probably annoyed me the most.  While logged into GV online, I read and respond to my \"texts\" from the site, rather than use airtime.  However, GV still forwards messages to my phone while I'm logged in so I'm them required to delete them from the phone.  Facebook provides an option to turn off messaging while one is logged into the site and such a feature would probably be a very valuable addition to Google Voice.</li>\n</p>\n",
        "<p><li>No SMS filtering.  Despite all the \"call anti-spam\" and such, there is no filtering whatsoever with SMS- everything is forwarded.  There are people who I don't want to recieve texts from- on my phone at least.  SMS filtering would probably be a good addition to the feature list.</li>\n</p>\n",
        "<p><li>Voicemail transcription, to my experience so far, sucks.  Yet another feature that could use a lot of improvement, it hasn't accurately picked up more than a few words from any of my voicemails.  However, I don't consider this particularly major because Google has just started developing their \"transcription engine\".</li>\n</p>\n",
        "<p><li>Few phone-controllable options.  This seems like a very important feature that would be widely used and yet it doesn't yet exist.  Facebook provides options that can be texted to facebook to stop or start texting from the site (and many other things for social functions).  Google Voice should be able to, it seems, have more controllable options via call or texting.  Other things, like controlling what phones will ring seems like another feature that should be accessable from a phone-interface.  It also seems like a wise idea to allow logging out of GV's web interface from a phone for the cases where it's left logged in in a place where it shouldn't be left logged in, though I'm not sure whether that's possible.</li>\n</p>\n",
        "<p></ul>For me, at least, Google Voice is a great and very useful service that allows me to manage my phone and messages more efficiently despite a few minor bugs.  Unfortunately, I haven't been able to test out switching phones during a conversation or having multiple phones on my account as I currently only have a TracFone and my family wouldn't appreciate me experimenting with the home phone.  GV seems to me like a service worth trying, and after I told a few friends about it myself, they rushed off to get invites.  The best part is, as with most Google services, is that it's free (though there is a charge for international calling).  Therefore, if you don't like it, there's no money lost.\n</p>\n"
    ],
    "date": "July 19, 2009",
    "tags": "communications, google, pros and cons, review",
    "datestamp": "2009-07-19T17:48:00-05:00"
}