{
    "title": "Facebook's New Privacy Controls",
    "content": [
        "<p><a href=\"http://lh6.ggpht.com/__BBcPvPuMhA/Sxrlh_VQKxI/AAAAAAAAAJE/Qy0C7wddCZ0/facebookSecurity.jpg\" imageanchor=\"1\" style=\"clear: right; float: right; margin-bottom: 1em; margin-left: 1em;\"><img border=\"0\" src=\"http://lh6.ggpht.com/__BBcPvPuMhA/Sxrlh_VQKxI/AAAAAAAAAJE/Qy0C7wddCZ0/facebookSecurity.jpg\" /></a>\n</p>\n",
        "<p>Facebook has rolled out a new set of privacy controls to its users as an attempt to simplify the controls so that more people can more effectively protect their information.\n</p>\n",
        "<p>The change has created a significant amount of negative hype across the Internet as users complain that the new controls are less effective and actually encourage users to publicize more of their profile.  These complaints are due to confusion from the controls Facebook provides to migrate user settings to the new controls.  Facebook is not clear in explaining that the transition tool is <u>NOT</u> the actual privacy panel- it allows users to select Facebook's recommendations for settings or to keep their old settings.\n</p>\n",
        "<p>The new privacy panel is as powerful as the old one, though it is laid out more simply.  It can be accessed the same way as the old panel; by hovering over the \"Settings\" menu on the blue bar at the top of the page and clicking on \"Privacy\".  All of the settings from the old panel can still be accessed and customized as before.  It should be noted that controls for the visibility of the \"Friends\" list have been removed; it can only be set to be visible to everyone or invisible to everyone.\n</p>\n",
        "<p>There are no other particularly noticeable changes other than the new categories on the landing page for Privacy.  There are now five categories; \"Profile Information\", \"Contact Information\", \"Applications and Websites\", \"Search\", and \"Block List\".  As for what settings can be found in each it's fairly straightforward, \"Profile Information\" holds settings regarding what can be seen on your profile, for example.\n</p>\n",
        "<p>Improvements to the panel are some additional controls that break some sections of the Profile down in regards to permissions.  Religious and Political views can now be controlled separately.  Also, changing settings now requires re-entering your Facebook password in order to avoid accidental changes.  Another major addition is the option to choose permissions right when you post a link or status- you can select the permissions from status to status.\n</p>\n",
        "<p>The only issue I've seen with the new panel is that it appears to take longer to load than the old panel.\n</p>\n"
    ],
    "date": "December 10, 2009",
    "tags": "facebook, internet, privacy, security, social networking",
    "datestamp": "2009-12-10T15:55:00-05:00"
}