{
    "date": "August 21, 2009",
    "datestamp": "2009-08-21T18:35:00-05:00",
    "title": "The Downsides to Mobile Life: Conclusions",
    "content": [
        "<p><a onblur=\"try {parent.deselectBloggerImageGracefully();} catch(e) {}\" href=\"http://www.webdesign-guru.co.uk/icon/wp-content/uploads/phone-button.jpg\"><img style=\"margin: 0pt 0pt 10px 10px; float: right; cursor: pointer; width: 182px; height: 182px;\" src=\"http://www.webdesign-guru.co.uk/icon/wp-content/uploads/phone-button.jpg\" alt=\"\" border=\"0\" /></a><br />As the Internet grows and more devices gain the ability to connect to it, our online presence grows.  As mentioned in earlier posts in this series, there are significant downsides to being constantly connected or addicted to the Internet.<br /><br />However, that's not to say that it's all bad or that we should turn to older means of communication (snail mail, anyone?).  Being online has some distinct benefits providing one does not sit in front of their computer 24/7 or has a cell phone implanted in their molars (<a href=\"http://www.wired.com/science/discoveries/news/2002/06/53302\">http://www.wired.com/science/discoveries/news/2002/06/53302</a>) so they don't miss a single thing when not on a computer.<br /><br />Being online everywhere opens up a whole new world of information, quite literally.  Information about nearly anything (and anyone, as it would seem) is right at the fingertips of anyone with access to the Internet, whether that information is about something right next to them or across the world.  Such information can aid in making healthy decisions, staying safe, keeping up with local events, and even the more personal, keeping up with family happenings.<br /><br />In order to make the best of online life, it's best to stay aware of the potential dangers and to use it in moderation (I could make that my blog catchphrase I say it so much).  Keep in touch with the physical world and communicate face-to-face, for starters- that's what the human mind was made for.  In addition;<br /><ul><li>Look away from the computer/phone screen at something around 20 feet away every 20 minutes to prevent eyestrain.</li><li>Get outside and go for a walk to take a break and get some exercise.</li><li>If you're addicted to it, get help from a counselor or family to break it and get your life back.</li></ul>Some more tips are available here; (please note I don't own these sites and I'm not responsible for anything else that might be on them)<br /><ul><li><a href=\"http://www.ribbit.net/computers_health_hazard.html\">http://www.ribbit.net/computers_health_hazard.html</a>  (Tips for preventing eyestrain, carpal tunnel, and back and neck pain caused by computer use)</li><li><a href=\"http://www.ehow.com/how_4848485_break-internet-addiction.html\">http://www.ehow.com/how_4848485_break-internet-addiction.html</a>  (How to break an Internet addiction)</li></ul>Living online, whether constantly or sporadically is a lifestyle choice and requires some decisions on the part of the user in order to fit it into their life and where they will be connected.  Despite the bad, I spend a lot of time online and I'm aware of it and choose to live that way.  There's nothing wrong with it unless it becomes an actual problem.<br /><br />Enjoy the Internet, but use it wisely with an eye towards the negative effects of an online lifestyle.\n</p>\n"
    ],
    "tags": "communications, health, internet, life, world"
}