{
    "tags": "communications, facebook, internet, social networking",
    "title": "Facebook Memorials",
    "datestamp": "2009-10-26T18:50:00-05:00",
    "content": [
        "<p><a href=\"http://lh4.ggpht.com/__BBcPvPuMhA/SxrlAtuLQnI/AAAAAAAAAJA/sgV_fcmygh8/facebook.png\" imageanchor=\"1\" style=\"clear: right; float: right; margin-bottom: 1em; margin-left: 1em;\"><img border=\"0\" height=\"200\" src=\"http://lh4.ggpht.com/__BBcPvPuMhA/SxrlAtuLQnI/AAAAAAAAAJA/sgV_fcmygh8/facebook.png\" width=\"200\" /></a>\n</p>\n",
        "<p>As the use of social networking grows for both personal and professional use, how to deal with the profile(s) of a deceased person has been slowly making its way into the thoughts of the maintainers of Facebook, among other sites.\n</p>\n",
        "<p>Given the idea of social networking, which is partly to show off relations, disabling or deleting profiles of the deceased defeats the purpose while also highlighting the loss (for any friends and family on the site as well).  With the apparent death of a Facebook employee, dealing with this issue has been brought directly into the hands of his friends.  Announced today is the new \"Memorial Profiles\" for the deceased.  Directly from the Facebook blog;\n</p>\n",
        "<p><blockquote><i>We understand how difficult it can be for people to be reminded of those who are no longer with them, which is why it's important when someone passes away that their friends or family contact Facebook to request that a profile be memorialized. For instance, just last week, we introduced new types of <a href=\"http://blog.facebook.com/blog.php?post=162648987130\" target=\"_blank\" title=\"http://blog.facebook.com/blog.php?post=162648987130\">Suggestions</a> that appear on the right-hand side of the home page and remind people to take actions with friends who need help on Facebook. By memorializing the account of someone who has passed away, people will no longer see that person appear in their Suggestions.</i>\n</p>\n",
        "<p></blockquote>Facebook also states that the logins for the deceased person will be disabled so the account cannot be hacked, and that privacy will be set so that only previously confirmed friends can see and find it in search and write on their wall.  You can find the original Facebook post here:  <a href=\"http://blog.facebook.com/blog.php?post=163091042130\">http://blog.facebook.com/blog.php?post=163091042130</a>\n</p>\n",
        "<p>The question now is how other networking sites will take action with deceased member profiles as it becomes a more prevalent issue.\n</p>\n"
    ],
    "date": "October 26, 2009"
}