{
    "title": "Facebook Privacy Update",
    "tags": "facebook, privacy, safety, social networking",
    "date": "December 5, 2009",
    "content": [
        "<p><span style=\"font-size: x-small;\"><i>From the Facebook blog:&nbsp; <a href=\"http://blog.facebook.com/blog.php?post=190423927130\">http://blog.facebook.com/blog.php?post=190423927130</a>&nbsp;</i></span>\n</p>\n",
        "<p><a href=\"http://lh6.ggpht.com/__BBcPvPuMhA/Sxrlh_VQKxI/AAAAAAAAAJE/Qy0C7wddCZ0/facebookSecurity.jpg\" imageanchor=\"1\" style=\"clear: right; float: right; margin-bottom: 1em; margin-left: 1em;\"><img border=\"0\" src=\"http://lh6.ggpht.com/__BBcPvPuMhA/Sxrlh_VQKxI/AAAAAAAAAJE/Qy0C7wddCZ0/facebookSecurity.jpg\" /></a>\n</p>\n",
        "<p>Facebook will be making some changes to the way its users control who can see their information within the next few weeks, which include changes to the privacy pages and networks.\n</p>\n",
        "<p><blockquote><i>...as Facebook has grown, some of these regional networks now have millions of members and we've concluded that this is no longer the best way for you to control your privacy.</i>\n</p>\n",
        "<p></blockquote>The first plans for Facebook's new privacy system is to remove regional networks.&nbsp; As Facebook founder Mark Zuckerberg notes, networks worked well for privacy before the site had millions of users; in the beginning the user base was mainly students, so each school had its own network.&nbsp; From then, networks have expanded to engulf entire regions in some cases.&nbsp; The vastness of these networks makes them unusable from the standpoint of using networks to control privacy.\n</p>\n",
        "<p>In addition to the removal of regional networks, a new set of privacy controls will be introduced which, according to the post on Facebook, will allow for more fine-grained control.&nbsp;\n</p>\n",
        "<p>Of course, with the introduction of a new system for privacy, your current settings will need to replicated on the new controls.&nbsp; Facebook promises to suggest new settings based on each user's current settings but they also recommend reading over the new options in order to ensure that your permissions remain the same and so that you can take advantage of the new options.\n</p>\n",
        "<p><blockquote>...<i>the best way for you to find the right settings is to read through all your options and customize them for yourself.&nbsp; </i>\n</p>\n",
        "<p></blockquote>As always, all users will be notified of the changes as they're rolled out.\n</p>\n"
    ],
    "datestamp": "2009-12-05T16:24:00-05:00"
}