{
    "date": "September 1, 2009",
    "tags": "gmail, google, internet",
    "datestamp": "2009-09-01T18:01:00-05:00",
    "title": "Google's Global Downtime",
    "content": [
        "<p><a href=\"http://lh4.ggpht.com/__BBcPvPuMhA/Sxriplrf9lI/AAAAAAAAAI8/MIrlgZ7Augg/google.jpg\" imageanchor=\"1\" style=\"clear: right; float: right; margin-bottom: 1em; margin-left: 1em;\"><img border=\"0\" height=\"162\" src=\"http://lh4.ggpht.com/__BBcPvPuMhA/Sxriplrf9lI/AAAAAAAAAI8/MIrlgZ7Augg/google.jpg\" width=\"200\" /></a>\n</p>\n",
        "<p>Early today Google's mail service, GMail, experienced some major downtime across the globe.  GMail users who attempted to access their online inbox during the outage would recieve a 502 error- or in more complicated terms,  “the upstream server and the gateway/proxy do not agree on the protocol for exchanging data” (1).\n</p>\n",
        "<p>I use GMail as my primary mailbox online and route everything into it, so it affected me as much as all other users across the globe.  It would seem that GMail was still accessable, although sporadically, through offline software via POP3 or IMAP (the web interface was unreachable).  According to news articles, the outage affected Google internally in addition to all the annoyed users across the globe.\n</p>\n",
        "<p>Those who pay for Google services such as GMail for their businesses recieve extensions of their service contracts to make up for Google's rare downtime.\n</p>\n",
        "<p>As with most major online or offline things, Twitter and other areas in the Blogosphere have been very active regarding the GMail outage (and more recently, it's return)- simply search for GMail on Twitter and you hundreds of thousands of results from around the globe in Spanish, English, French, and Korean (of those that I saw and Korean I'm just guessing) so if you need to find out more, simply search those sites.\n</p>\n",
        "<p>Other Google services have also apparently experienced short-lived outages since Saturday (August 29th).(2)  It appears that the GMail issue has largely been resolved, as far as Tweets say, and should be restored fully to all users by later today if it hasn't been already.  Google is still investigating the reason for the downtime and hasn't posted any information on it as of yet, but I'll try to keep you posted when they do.\n</p>\n",
        "<p>Kudos to Google for providing information quickly and giving us updates on their progress via their help center and the Google blog (3). \n</p>\n",
        "<p><a href=\"http://www.blogger.com/goog_1251840970441\">\n</p>\n",
        "<p></a>\n</p>\n",
        "<p><ol><li><a href=\"http://thenextweb.com/2009/09/01/google-experiencing-downtime-world/\">http://thenextweb.com/2009/09/01/google-experiencing-downtime-world/</a> </li>\n</p>\n",
        "<p><li><a href=\"http://news.cnet.com/8301-30685_3-10323306-264.html\">http://news.cnet.com/8301-30685_3-10323306-264.html</a> </li>\n</p>\n",
        "<p><li><a href=\"http://gmailblog.blogspot.com/\">http://gmailblog.blogspot.com/</a></li>\n</p>\n",
        "<p></ol><i><b>Update 6:17PM 9/1:  </b></i>After a bit of digging, I found that there was another major GMail outage earlier this year in February that was related to system maintenance- some new code that keeps a user's information geographically close to them malfunctioned and was overloaded, bringing the system down.  While this may be the case this time as well (seeing as I have no idea when Google performs maintenance),\n</p>\n",
        "<p><u><i><b>Final Update:</b></i></u>  Google released some insight into the problem:  <a href=\"http://natesphilosophy.blogspot.com/2009/09/googles-global-downtime-what-happened.html\">Read Here</a>\n</p>\n"
    ]
}