{
    "datestamp": "2009-08-07T18:08:00-05:00",
    "date": "August 7, 2009",
    "tags": "communications, internet, life",
    "content": [
        "<p><a onblur=\"try {parent.deselectBloggerImageGracefully();} catch(e) {}\" href=\"http://www.webdesign-guru.co.uk/icon/wp-content/uploads/phone-button.jpg\"><img style=\"margin: 0pt 0pt 10px 10px; float: right; cursor: pointer; width: 180px; height: 180px;\" src=\"http://www.webdesign-guru.co.uk/icon/wp-content/uploads/phone-button.jpg\" alt=\"\" border=\"0\" /></a><br />Many workplaces now give out pagers and phones and similar to their employees, the idea being able to stay in touch with them while they're outside of work (defeats the purpose of being out of work, doesn't it?).  Now it's not possible to leave the dreaded work world, it goes wherever you go (the 'dead zone' seems to be becoming a person's best friend!)<br /><br />Staying connected via MIDs (mobile Internet devices) is very easy and makes life unavoidable.  There's no escaping the workplace, friends, family, or seemingly anything anymore as soon as one gains a mobile portal.  Staying connected can be good, but it has its downsides:<br /><ul><li>Everything goes with you...that is, EVERYTHING</li><li>You're on call 24/7 for, well, everything.  Work is able to get in touch with you no matter where you go and for any reason.  You know that forest you like to hike through?  That could become your office someday.</li><li>You can't escape who and what you may want to escape.  There's good reason to get away from it all- time away from family and friends and work.  With a MID there is no way to get away, they can get in touch no matter where you are.</li></ul>Staying connected has started to mean being in 'the loop' and keeping up with everything.  There's nothing inherently wrong with it, but getting away from that annoying neighbour or that friend who calls you every five minutes is always nice, but next to impossible while still being connected.  It does pay to get away.  Though it's becoming harder to escape, there are ways you can disconnect;<br /><ul><li>Turn off your phone, shut down your netbook, log off the Internet.  It really is that simple for those who aren't addicted to it.  Put it away and forget about it until you want or really need to 'reconnect'</li><li>Get out of range of the Internet and camp out in a 'dead zone' where you can't be reached.  That way, there's no guilt involved when coming back to say \"yeah, I wanted to get away\".  The cottage I stay in for a week during the summer has no cell reception- you can only get a good signal in the middle of the lake.</li><li>Forget about it- Facebook and your friend breaking up their relationship doesn't need to come instantly.  If all else fails, only read the messages you actually need to read, not all those \"hey watcha doin\" and \"you have been poked, reply 'P' to poke back\" messages.</li></ul>Becoming \"mobile\" means a whole change in lifestyle to incorporate the online world into everyday life.  Unfortunately, unlike with just computers giving access to the Internet, MIDs allow the Internet to travel wherever you go, so you're always connected.  Granted, that's not always a bad thing, there are good reasons to be online.  However, for some it's not enjoyable, but the mobile aspect becomes significantly harder to escape.\n</p>\n"
    ],
    "title": "The Downsides to Mobile Life: Part 2- Unescapable"
}