{
    "title": "The Downsides to Mobile Life: Part 3- Health",
    "content": [
        "<p><a onblur=\"try {parent.deselectBloggerImageGracefully();} catch(e) {}\" href=\"http://www.webdesign-guru.co.uk/icon/wp-content/uploads/phone-button.jpg\"><img style=\"margin: 0pt 0pt 10px 10px; float: right; cursor: pointer; width: 201px; height: 201px;\" src=\"http://www.webdesign-guru.co.uk/icon/wp-content/uploads/phone-button.jpg\" alt=\"\" border=\"0\" /></a><br />As with seemingly anything, living constantly online with an MID (mobile Internet device) has effects on one's health, and generally negative effects for that matter.  From the skin to the mind, online life takes a toll.  Much of the problems that arise are due to choices of the user, such as where and when they are 'connected'.<br /><br />Unlike some \"theoretical problems\" however, all the effects I have listed have been documented problems.  What's more, the desirable effects of being social and in contact with friends often don't apply in the online world in the same way that they do with actual real-world face-to-face communications.  It seems that being constantly online with an MID is more detrimental to one's health than it is beneficial.<br /><ul><li>Being connected produces stress, especially in the area of work communications.  Stress, as most know, is not good for one's health, but we won't get into that here.</li><li>Small screens produce eyestrain.  Actually, most computer screens cause strain on the eyes because of the way that they generate images.  However, smaller screens magnify that effect because of their small size.</li><li>Addiction.  Living online can eventually turn into a very real addiction, one that is magnified by MIDs that have external message indicators- seeing a message light flashing makes it very difficult to ignore.</li><li>Skin disease.  This one I haven't heard of happening in phones, but hard-core gamers do develop a skin disease on their hands brought on by the game controller and repetitive movements.  However, I would say that this potentially could happen in hard-core texters.</li><li>Sleep deprivation.  Similar to the addiction issue, some people do stay up very late in order to be online and stay connected.  This leads to lack of sleep which in turn leads to a whole slew of other problems.</li></ul>Many of these problems are due to over-use of mobile devices and are easily avoided.  However, in many cases that's easier said than done as 'being connected' IS life for certain people (and if you're one of them, seriously try to cut back on Internet time).  Avoiding them, in practice, may be harder to do than it sounds, though the methods are fairly straightforward.<br /><ul><li>Set a specific bedtime that will allow you to get enough sleep.  Turn off phones, computers, and anything else in order to sleep through the night without interruptions.</li><li>Don't spend too much time staring at a screen.  Do what needs to be done and get off, don't invent tasks.</li><li>Set days to get away from it all, such as Sunday in order to relax for the week ahead.<br /></li><li>Talk in person- it eliminates all the problems completely.</li></ul>Living online is one thing, living completely online is an entirely different thing.  However, the main thing to keep in mind is how much time is spent on a MID and what's being done at the time.  Health effects result only from overuse, so as with most other things, always in moderation.\n</p>\n"
    ],
    "datestamp": "2009-08-14T18:35:00-05:00",
    "tags": "communications, internet, life",
    "date": "August 14, 2009"
}