{
    "datestamp": "2010-01-12T18:29:00-05:00",
    "content": [
        "<p><a href=\"http://lh3.ggpht.com/__BBcPvPuMhA/S00FCfQoTsI/AAAAAAAAANA/mDCbm1GVkOE/googleCROP.jpg\" imageanchor=\"1\" style=\"clear: right; float: right; margin-bottom: 1em; margin-left: 1em;\"><img border=\"0\" height=\"200\" src=\"http://lh3.ggpht.com/__BBcPvPuMhA/S00FCfQoTsI/AAAAAAAAANA/mDCbm1GVkOE/googleCROP.jpg\" width=\"187\" /></a>As many of us know, Google has provided a variety of online services for some time; starting with the well-known search engine, and now GMail, Google Docs, Google Groups, Google Sites, Google Voice, and all manner of other things.\n</p>\n",
        "<p>However, where Google has lagged behind many other services is its lack of dedicated file storage.  Windows Live has provided online storage for some time now and recently bumped its capacity to 25 gig.  Various other sites dedicated to file storage have cropped up as well, such as the well-known Box.net and Dropbox.com to name just a few.  In the meantime, Google has introduced other services for storing and sharing photos (2 gig), and steadily increased the space allotment for GMail which currently hovers close to 7 gig.\n</p>\n",
        "<p>As of a recent announcement from Google, this is about to change as Google finally plans to provide a unified system for file storage, rather than its currently segregated systems for email, documents, and photos.  According to their announcement, Google Docs will become the one-stop shop for online storage from Google.\n</p>\n",
        "<p>The new features will be rolled out within the coming weeks to allow users to upload more than supported document files to their Docs account.  1 gig of storage will be provided for free to store uploaded files, though any files uploaded and converted to Google Docs format (spreadsheet, presentation, and document files) will <u>not</u> count towards the storage limit.  For any users needing additional space, Google will provide more space for $.25 per gig per year.\n</p>\n",
        "<p>Judging by the announcement on the <a href=\"http://googledocs.blogspot.com/2010/01/upload-and-store-your-files-in-cloud.html\">Google Documents Blog</a>, the long-awaited ability to share entire folders will be introduced as well so that users will be able to take full advantage of the new features.\n</p>\n"
    ],
    "tags": "communications, data, google, internet",
    "date": "January 12, 2010",
    "title": "File Storage from Google"
}