{
    "datestamp": "2010-05-13T16:21:00-05:00",
    "content": [
        "<p><a href=\"http://2.bp.blogspot.com/__BBcPvPuMhA/Sxre-GQunCI/AAAAAAAAAIs/9vEzG8I9loU/s1600/wireless.png\" imageanchor=\"1\" style=\"clear: right; float: right; margin-bottom: 1em; margin-left: 1em;\"><img border=\"0\" src=\"http://2.bp.blogspot.com/__BBcPvPuMhA/Sxre-GQunCI/AAAAAAAAAIs/9vEzG8I9loU/s1600/wireless.png\" /></a>Slowly and steadily technology has been trickling into the classroom, starting with calculators and slowly growing to more complex equipment.  Schools have, for a fair amount of time, featured computer labs for students and later, computers in classrooms for teacher use with grading software.\n</p>\n",
        "<p>In all honesty, the Internet is best kept away from the main part of the curriculum in schools.  With the negative side of the Internet forgotten [for the moment] and we forget all the issues with porn and such- which students will always find a way to look at in school despite the best efforts of administrators- there's simply nothing inherently necessary about bringing the Internet to the classroom.\n</p>\n",
        "<p>Society is changing and does focus around the use of a computer or cell phone or other connected gadget- it's getting harder to stay away from everything (and everyone).  Writing with a pencil is starting to fade out as typing takes over, for example- even in schools.  I took the SAT a few weeks ago and only a handful of my friends taking it knew how to write in cursive for the certification statement.  In our school district, typing lessons start in elementary school and teachers encourage students to type, rather than write, assignments.  The more we bring the Internet and therefore computers into academics, skills will vanish- writing becomes obsolete, mental math is forgotten (where it hasn't been already), figuring things out is no longer necessary.  Load up a web browser and someone else already figured it out.\n</p>\n",
        "<p>That's not even taking into account the distractions- computers and the Internet have games, and students will always be able to get around any blocks set up by system administrators.  Each student may have a world of opportunities on his or her desk in the form of a laptop- but they're more likely to take advantage of the world of distractions to escape the day's boring lecture.\n</p>\n"
    ],
    "tags": "computer, education, life",
    "title": "The Digital Classroom",
    "date": "May 13, 2010"
}
