{
    "tags": "communications, internet, life, privacy, social networking, world",
    "date": "March 24, 2010",
    "title": "What's your legacy?",
    "datestamp": "2010-03-24T19:49:00-05:00",
    "content": [
        "<p><a href=\"http://lh5.ggpht.com/__BBcPvPuMhA/Sxre-GQunCI/AAAAAAAAAIs/9vEzG8I9loU/wireless.png\" imageanchor=\"1\" style=\"clear: right; float: right; margin-bottom: 1em; margin-left: 1em;\"><img border=\"0\" src=\"http://lh5.ggpht.com/__BBcPvPuMhA/Sxre-GQunCI/AAAAAAAAAIs/9vEzG8I9loU/wireless.png\" /></a>Any of us who uses the Internet regularly, especially for forums, message boards, and any other social networking have some traces of our activities across the Internet.  Some of us have the fortune (or misfortune, as it may be), of showing up in Google results when someone searches for us.  I personally have over 300 Google results to my online nickname- various forum posts, user pages, Twitter, LinkedIn, etc, plus should anyone search my full name, the first result also happens to be me.  In order to achieve this, I maintain somewhere around 5 blogs, 3 forum profiles, at least 4 OpenID profiles, Twitter, MySpace, Facebook- you get the picture.\n</p>\n",
        "<p>After putting some thought into it, however, I realized that I don't want to be that searchable.  I work to build online identities for other businesses on social media and online in general, and I have my own online identity to prove it.  Effectively, I've carved out my own niche with a unique name, my own set of Google results, and my own set of sites.  As of now, however, I no longer have MySpace, 4 OpenID pages and I'm down to 3 blogs, Twitter, and Facebook.  The number of Google results pertaining to me continue to rise, however- there's no erasing the tweets of other people mentioning me, and Wikipedia user pages are spread across a variety of mirror sites.\n</p>\n",
        "<p>My legacy is a rather large online niche, powered by The Philosophy of Nate.  My legacy is hundreds of Google results that show that I'm a major tech geek.  Actually, that's not who I am.  I'm a math geek, and given the choice, I'd rather be out camping or playing sports than sitting online.  My legacy isn't true to who I am- it's true to what I use the Internet for, which is to solve computer problems.  I have the fortune of my online identity being \"safe for work\", mainly because I am careful about what I post online, and even though it's not entirely true to my personality, it won't hurt my chances of getting into college.\n</p>\n",
        "<p>What's your legacy?\n</p>\n"
    ]
}