{
    "content": [
        "<p><a href=\"http://lh6.ggpht.com/__BBcPvPuMhA/SxrciGFLF1I/AAAAAAAAAIk/q79VQ13ceyA/chat.png\" imageanchor=\"1\" style=\"clear: right; float: right; margin-bottom: 1em; margin-left: 1em;\"><img border=\"0\" height=\"194\" src=\"http://lh6.ggpht.com/__BBcPvPuMhA/SxrciGFLF1I/AAAAAAAAAIk/q79VQ13ceyA/chat.png\" width=\"200\" /></a>Over this week both Google and Facebook have been rolling out some changes to their services.  Facebook has again thrown a new layout at us, moving things around and changing their look a bit, though with no warning at all.  Most noticeably, the bottom bar on the site with chat, notifications, bookmarks, and the application menu has been taken away leaving only the chat menu.\n</p>\n",
        "<p>Application bookmarks now appear in the sidebar of the site, similar to where they were a few layouts back if anyone remembers it.  Messages (aka the Inbox), event invitations, and an equivalent to the old \"Friends\" menu can be found above them, replacing the former news feed filters.  'Photos' opens a gallery view of all the photos recently uploaded to Facebook from friends and submenus filter out Videos, mobile uploads, and your own photos.  At the bottom of the sidebar is a short list of a few online friends from chat.  Most noticeably, notifications no longer appear at the lower right, they now have their icon by the upper left which takes a bit of getting used to.  If my friends are any indication, the latest layout change is more popular than some of the previous ones because I haven't seen a flurry of groups being joined requesting the layout be changed back.  The new layout seems to give more focus to what's actually happening on Facebook in regards to uploads and statuses from friends rather than having a fair amount of whitespace.\n</p>\n",
        "<p>As if to counter this move, Google introduced a new feature to its GMail users called 'Google Buzz'.  Buzz works with the existing contact list and will automatically list other Buzz users for you to \"Follow\" and allows them to follow you in return.  More or less, Google Buzz appears to be Google's attempt at pulling social networking directly into your inbox.  You can pull in updates from Google Reader, Twitter, Flickr, Picasa, and Google Chat for Buzz to share with your followers and allows you to post your own updates, similar to Facebook.  For me, Google Buzz is relatively useless because I protect my Tweets, don't use Flickr, and don't have any shared items in Google Reader, though the same may not be true for other 'Googlers'.  I have seen \"Share on Buzz\" links on some sites so as people start to play with it, Buzz may take hold.  Unfortunately for me, most of my Google contacts don't use Google, and social networking is no fun if you have nobody to network with.\n</p>\n"
    ],
    "datestamp": "2010-02-11T17:23:00-05:00",
    "date": "February 11, 2010",
    "title": "Google Buzz and Facebook layout",
    "tags": "communications, facebook, google, internet, social networking"
}