{
    "tags": "communications, data, email, life, privacy, safety, security",
    "title": "How we should protect our friends' information",
    "datestamp": "2010-03-16T18:07:00-05:00",
    "content": [
        "<p><a href=\"http://picasaweb.google.com/lh/photo/uaXgFfk8m9Pr9JS2-1dwSw?authkey=Gv1sRgCI_7q_HfyrGKmQE\" imageanchor=\"1\" style=\"clear: right; float: right; margin-bottom: 1em; margin-left: 1em;\"><img border=\"0\" height=\"200\" src=\"http://2.bp.blogspot.com/__BBcPvPuMhA/SxrbdyL07KI/AAAAAAAAAIg/QBtchKNJD3E/s200/padlock.png\" width=\"200\" /></a>We all know by now that our information is somewhere- be it online or off.  There's various contact management sites, such as Google Contacts, Plaxo, and others, and they presumably have appropriate precautions set up in order to protect information that users choose to share about themselves (and their contacts).\n</p>\n",
        "<p>However, what about information about us such as email addresses or phone numbers that friends store on their computers?  In a disturbing amount of times, this information is stored in an email client's 'address book' on a relatively insecure computer.  One of our friends, somewhere, has sensitive data stored about us on their computer- a fact that is inevitable due to the many services provided by software, things such as chat records, contact information, and a number of other things.  There's no real way to know how personal information is being dealt with the second it's published to the Internet or even simply shared with friends.\n</p>\n",
        "<p>Case in point- Chi.mp recently discontinued its \"Ultimate Black Book\", a contact management system on their site that allowed users to import and merge contacts from various websites.  I downloaded my entire contact list as a VCard and stored it on my desktop while I attempted to figure out what to do with it- all 130 contacts complete with names, email addresses, web addresses, and phone numbers.  Some people wouldn't give a second thought to leaving this information on their computer- which is unfortunate for those of us with less-than-tech-savvy friends who's passwords may be along the lines of \"password\".  As someone who considers his computer to be decently secure, I felt extremely uncomfortable about leaving this mass of personal information relatively unprotected on my system- and I'm behind two firewalls on a secured Linux system with a powerful password and that's disconnected from the Internet for a good part of the day (it's a laptop).\n</p>\n",
        "<p>Rather than shutting my system off and going to bed, I fired up the encryption software bundled with my system and encrypted the file- then shredded the unencrypted copy.  I felt that this was sufficient security not only for me, but for my friends' information, while I stored my contact list and searched for a new online service for a few days- and I eventually settled on Google Contacts.\n</p>\n",
        "<p>Maybe I'm just paranoid, but the thought of my personal information floating around on a friend's computer unprotected bothers me somewhat.  I feel good about my method of storing contact information for the various people I'm in touch with, especially since had the inevitable happened- someone hacked my computer, or worse, someone stole my computer, they probably would have had a fair amount of trouble stealing data about my friends.\n</p>\n"
    ],
    "date": "March 16, 2010"
}