{
    "title": "Introducing Google Buzz",
    "content": [
        "<p><a href=\"http://lh6.ggpht.com/__BBcPvPuMhA/S3stH5s3PJI/AAAAAAAAAPk/RD_wEQofo18/189204-google_buzz_inline_original.jpg\" imageanchor=\"1\" style=\"clear: right; float: right; margin-bottom: 1em; margin-left: 1em;\"><img border=\"0\" src=\"http://lh6.ggpht.com/__BBcPvPuMhA/S3stH5s3PJI/AAAAAAAAAPk/RD_wEQofo18/189204-google_buzz_inline_original.jpg\" /></a>For anyone who hasn't already heard, Google Buzz was introduced just last week as Google's attempt at getting in on the social web.  In effect, Buzz is a simple combination of Facebook and Twitter; users can post updates in the form of status messages, links, or images and pull in updates from a number of other sites.  Buzz users can follow other Buzz users, similarly to Twitter, and any updates will be announced next to the GMail inbox.\n</p>\n",
        "<p>The concept is simple enough, but won't offer Google much leverage against already established networking sites such as Twitter and Facebook simply because the system is not well implemented as it stands.  Already, Buzz has been integrated into some sites such as Mashable.com next to all the other \"Tweet this\" and \"Share this\" links and all of the hype about the system is bound to draw some users.  However, there already have been some significant problems with spamming, which forced Google to release updates to Buzz.  As for other issues, Buzz will sometimes notify users about the same 'new' follower multiple times, and the fact that it will announce comments also proves to be an annoyance especially for posts that users hadn't been interested in in the first place.\n</p>\n",
        "<p>As for myself, Google Buzz proves to be rather pointless and just another \"thing to deal with\" in my online world.  I have two followers, whom Google probably automatically subscribed to me, and I follow 6 people.  Not a single update has been posted other than me pulling in updates from this blog to display on my Google profile.  The reason behind this is that my contacts and I already use <i>other</i> services such as Twitter and Facebook, so Buzz isn't of any use to us.  That, and many of my friends don't use Google.\n</p>\n",
        "<p>I've seen Buzz described as something that will be useful mainly to users of Google Apps for business communication and I think that this will probably be the case.  Google Buzz isn't Google's first attempt to get its piece of social media in the mix;  Google Orkut has been around for a while but is only widely used and popular in Japan.  Will Google Buzz gain ground in the future?  It's possible, given that updates can be brought in from other sites, but probably not likely unless Google also allows for posting TO those sites.\n</p>\n"
    ],
    "datestamp": "2010-02-16T18:46:00-05:00",
    "tags": "communications, google, internet, social networking",
    "date": "February 16, 2010"
}