{
    "date": "November 14, 2010",
    "datestamp": "2010-11-14T16:39:00-05:00",
    "title": "Thoughts on Windows 7",
    "content": [
        "<p><a href=\"http://1.bp.blogspot.com/__BBcPvPuMhA/SzKtlERTFPI/AAAAAAAAALY/swJfTLvBcRw/s1600/microsoft-logo.png\" imageanchor=\"1\" style=\"clear: right; float: right; margin-bottom: 1em; margin-left: 1em;\"><img border=\"0\" height=\"184\" src=\"http://1.bp.blogspot.com/__BBcPvPuMhA/SzKtlERTFPI/AAAAAAAAALY/swJfTLvBcRw/s200/microsoft-logo.png\" width=\"200\" /></a>As many of my readers know by now, I'm not a big fan of Windows.  I've been an avid Linux user since I was in 7th grade, which is 5 years.  I'm forced to use Windows at school, however, and often when I borrow computers.  It's an unfortunate fact that the majority of people happen to use Windows.  Then the other majority is Mac OS X; which I'm not a fan of either.  Then finally, in last place, we have Linux.<br /H>\n</p>\n",
        "<p>Honestly, I am an operating system snob; I insist on using Linux and I've found that if I use Windows enough, I get a headache.  I do give each new version of Windows a fair try though, because eventually <i>eventually</i> they may come out with one that I like.  Well, that and I need to know my way around.  My laptop shipped with Windows 7 and my school is transitioning to 7 as well.\n</p>\n",
        "<p>It's not my favorite, I'll admit that right off the bat, but once again, I'm a little biased.  Actually, I don't mind dealing with it.  Of my experience with Windows, 7 is the best I've used.  It has a decent interface, it's simplified, and it's definitely much less bloated and buggy than was Vista.  It lets me do almost everything that I need to do with it without any major problems; though it has its quirks that annoy me.  \"Snap\" is one of the most useful, yet most irritating things Microsoft has ever put into Windows (and no, the office assistant doesn't factor in here because that was simply the most irritating).  I'm accustomed to dragging windows to the edges of the screen so that they're out of my way but not minimized, which triggers Snap to size and position them.  I always, <i>always</i> seem to be triggering Snap when I don't want it, which is about 90% of the time, and I was left searching for a way to turn it off.  However, it does have its uses; I love it when I'm coding a web page, I can snap my window of code to one half of the screen and a browser to the other and switch between them fast.\n</p>\n",
        "<p>There often seems to be a problem with Windows Explorer every time I boot into 7.  I'd say about 6 times out of 10, it crashes on me.  I don't know why and there doesn't seem to be any reason for it, but it crashes.  The system does a good job of recovering from it most of the time, but it's still annoying.  It's been less of a problem for me lately though, so Microsoft must be working on it on their end.\n</p>\n",
        "<p>Among the more interesting quirks I've found that...moreso amuse me than annoy me, is the whole networking thing.  By default, 7 doesn't turn on network sharing; which is fine, until I need to use it at school because I'm in a class that makes heavy use of file sharing for turning in assignments and for <a href=\"http://thsnewschannel12.org/\">THS NewsChannel 12</a> content which I'm highly involved with.  Until network sharing stuff is turned on, 7 also won't let me browse the network; which is easy to get around in my experience.  I've found that to bypass that, I simply need a link to a network location and BINGO! I'm doing what 7 tells me I can't.\n</p>\n",
        "<p>My only other gripe about 7 is the new taskbar.  I like it, though it took me a while to start liking it.  Coming from older versions of Windows and Linux...I like my taskbar to have text, not just icons.  I've found that some of my techie friends agree with me and the first thing they do when they log into a school computer is to change the setting to give them back their old style taskbar.  I still prefer my taskbar to have text.\n</p>\n",
        "<p>With Windows 7, I have to give points to Microsoft; they did a decent job.  I'll still take my Linux any day though.\n</p>\n"
    ],
    "tags": "computer, microsoft, windows"
}
