{
    "title": "A review of the iPad",
    "tags": "apple, iPad, review",
    "content": [
        "<p><a href=\"http://3.bp.blogspot.com/__BBcPvPuMhA/TGA-l8hgiVI/AAAAAAAAAUw/A--egHq0gkI/s1600/ipad.jpg\" imageanchor=\"1\" style=\"clear: right; float: right; margin-bottom: 1em; margin-left: 1em;\"><img border=\"0\" height=\"229\" src=\"http://3.bp.blogspot.com/__BBcPvPuMhA/TGA-l8hgiVI/AAAAAAAAAUw/A--egHq0gkI/s320/ipad.jpg\" width=\"320\" /></a>I should probably start this off by saying that I'm not much for Apple products.  I don't like them- yes, they are cool, but as an avid computer user accustomed to tweaking every aspect of all his devices, I find them too limiting.\n</p>\n",
        "<p>In all honesty, I don't have much to say about the iPad- to me it wasn't much more than just another Apple product- cool, but not something I would ever use.  That's not to say I wasn't impressed, however.  The device feels very natural to use and the finger swipes and flicks are exactly as they look in any Apple advertisement for the iPad.  It's very simple to use and doesn't take long to get used to.  The first app I opened was Maps, and admittedly, it was very cool to be able to navigate the map with flicks of the fingers.\n</p>\n",
        "<p>Next, I turned to the App store, hoping to download some free apps- and was disappointed when I was informed that I needed an iTunes account.  In the end, I used another friend's iTunes logins to download some free apps because I have no use for iTunes myself and didn't want an account.  After playing Tanks with said friend for a while, we again turned to the App store looking to download Opera browser and some other apps.\n</p>\n",
        "<p>Opera Mini and Tap Tap don't have iPad versions.  Yes- they will run on the iPad, as will any iPhone and iPod Touch app, but you have two options- run it zoomed in and pixelized so it fills the full screen, or run it in it's original size.  Though not an iPad problem, the app store doesn't make it as clear as it could that apps for the iPhone are for the iPhone and iPad apps are for the iPad.\n</p>\n",
        "<p>Safari does have some nice features for a \"mobile\" device- multiple pages can be open at a time in the background but there wasn't anything about it that made it spectacular.\n</p>\n",
        "<p>To me, the iPad wasn't spectacular- it was very cool, but my experience with it didn't make me want to run out and buy one for myself.  The multitouch screen and well-tuned processor made it smooth and easy to use and it did feel like it packed a decent amount of power.  Typing on it was brutal- the autocomplete never seemed to figure out what I was trying to spell quite right, forcing me to correct my frequent typing mistakes by hand, and typing on the screen for some reason was very tiring, probably because I'm accustomed to the tactile response of a real keyboard.  I also seemed to constantly miss the spacebar.  In all, it to me was just another Apple product that limited me to what Apple wanted me to do with it.  I'm sure for some people, like one of my friends who also played with it, it would be a lot of fun and would take a lot of use.  Me?  I was sick of it after a day and turned back to my laptop.\n</p>\n"
    ],
    "date": "August 9, 2010",
    "datestamp": "2010-08-09T13:47:00-05:00"
}
