{
    "date": "February 3, 2010",
    "datestamp": "2010-02-03T19:28:00-05:00",
    "title": "Aggregating your Web Presence",
    "content": [
        "<p><a href=\"http://lh5.ggpht.com/__BBcPvPuMhA/Sxre-GQunCI/AAAAAAAAAIs/9vEzG8I9loU/wireless.png\" imageanchor=\"1\" style=\"clear: right; float: right; margin-bottom: 1em; margin-left: 1em;\"><img border=\"0\" height=\"200\" src=\"http://lh5.ggpht.com/__BBcPvPuMhA/Sxre-GQunCI/AAAAAAAAAIs/9vEzG8I9loU/wireless.png\" width=\"200\" /></a>Many active users of the Internet have multiple web presences;  between various social networks and websites, and for both professional and personal purposes.  For the most part, these presences are fairly scattered and don't have much connection from one to another.  This archipelago of online presences is in some ways limited;  Facebook natively only allows for links to other websites, Twitter only allows for one web link (not counting tweets).  Aggregating this mass of websites is important in order to build a functioning Internet identity for both professional and personal reasons;  making it easy for employers and friends to find you online and to make an online presence easier to manage.\n</p>\n",
        "<p>Initially, this is as simple as making yourself \"Googleable\" by consistently using the same username across all your networks.  Searching my online nickname, for example, yields over 100 results, all pertaining to me.  Among these are my Twitter, various blog posts, and forum posts (my nick is in my signature).  Given the huge amount of Internet users, usernames are becoming a bit scarce and it's nearly impossible to find an available name with no numbers in it.  I have a friend who simply uses his full name followed by the number \"12\", and so far as I've seen nobody else using that system.\n</p>\n",
        "<p>However, tying your Internet presence together is more than simply being consistent in the screen name you use across the 'net.  Connecting your network together is the next step so that one site can lead to another, to another, to another across the various online media you may use.  As this necessity is recognized, services, especially OpenID providers, have been adding possibilities to tie your network together through the use of their identity pages.  Chi.mp, especially, is very good in this sense because it provides users with a full website and domain name, links to the rest of their social media, the option of pulling in feeds from any number of blogs or otherwise, and with the upcoming paid service; redirecting subdomains.\n</p>\n",
        "<p>Lately, I've been working to tie my online world together a bit more and to use it to overcome limitations of some of the social networks I'm a member of.  My LinkedIn profile links to the professional and education pages of my website, for instance, so that I don't need to register every company I work(ed) for with LinkedIn.  Similarly, the front page of my website is a combined feed from all the websites I use and links to the rest of my network (most of which link back).\n</p>\n",
        "<p>Having grown up with the Internet, I have a well-established identity across a multitude of networks and only lately, having been employed and knowing that colleges will search for me online, I've started to tie my online presence together;  I want to be sure that when a potential college Googles me, they'll find <i>me</i> not the several other people who share my name.\n</p>\n",
        "<p>As a webmaster, I try to recognize this for those involved with the club I'm a part of, even though it's only for high school.  I re-coded our site page listing all the active club members to allow them to link directly to their name on the page from anywhere on the 'net.  Bragging rights aside, this also works well from a promotional standpoint;  they can link to their name on the site on say, their Facebook profile, and it draws visitors who view their profile to our website.\n</p>\n"
    ],
    "tags": "communications, facebook, internet, life, openid, social networking, world"
}