{
    "date": "March 1, 2010",
    "datestamp": "2010-03-01T20:24:00-05:00",
    "content": [
        "<p><a href=\"http://lh5.ggpht.com/__BBcPvPuMhA/Sxrd6Rc1SxI/AAAAAAAAAIo/QsHDBsRMD-k/ipod.png\" imageanchor=\"1\" style=\"clear: right; float: right; margin-bottom: 1em; margin-left: 1em;\"><img border=\"0\" height=\"200\" src=\"http://lh5.ggpht.com/__BBcPvPuMhA/Sxrd6Rc1SxI/AAAAAAAAAIo/QsHDBsRMD-k/ipod.png\" width=\"149\" /></a>Any modern student carries an array of electronics into school; cell phone, calculator, iPod, and a number of other things.  There is a question, however, of what electronics are appropriate for the classroom, and where to draw the line at what is and isn't allowed.\n</p>\n",
        "<p>For example, in my state, Connecticut, state law bans cell phone use in schools by students.  Some schools in the state follow this rule to the letter, while others are a bit more lenient, only confiscating them if they're being used.  Granted, phone use will still continue to some degree in school regardless as students repeatedly find methods of getting around the rules.\n</p>\n",
        "<p>Banning cell phone use in school is logical; it lowers the possibility of cheating and more or less eliminates a distraction- both for the person using it and others in the class.  Any device that is disruptive to the entire class should be banned seeing as there are students in a class who are there to learn and who are interested in the subject; and they learn alongside students of an opposing opinion who may have been put in the class by parents or simply because they need another credit to graduate.\n</p>\n",
        "<p>However, the question is whether the line should be drawn here, or if such rules should extend further to include other electronics.  My local school district has voted to add iPods to the list of 'classroom distractions' right alongside cell phones.  The issue with this policy is that iPods are only distracting to the person using them- providing the person isn't attempting to blow out their eardrums at an excruciatingly high volume.  For such devices that are only distracting for the student using them, they're technically not a problem and possibly, a solution to a problem; they keep the uninterested students quiet; and anyone else who has one if they finish an exam before others.  As a fellow student states, \"I feel like it's my choice whether or not to be distracted.\"\n</p>\n",
        "<p>With the line drawn at iPods, which again are only distracting to the user, other things could be considered equally disruptive; take calculators, for example.  The latest graphic calculators owned by students for advanced math classes generally come with a set of games, more of which are available for download online.  Students can play games on them or, for a select few, write their own programs to play with at any time in or out of class.  In this essence, they are as distracting to the user as an iPod is, yet they cannot be removed from the classroom because they're a necessity.\n</p>\n",
        "<p>The line between what electronics are and are not permitted in the classroom is blurry because of differing opinions in what is, and isn't a distraction.  Laptops and cell phones can both fall decently on the 'distraction' side of the line because they have the clear potential to distract not just the user but other students in the classroom.  iPods, not so much- they distract their user but usually not others in the class.  The question of what electronics should be allowed in the classroom is difficult to answer, but more things need to be considered than just in-class use such as use after exams or in the halls.\n</p>\n"
    ],
    "title": "Electronics in the Classroom",
    "tags": "education, life, tech, world"
}