{
    "datestamp": "2010-01-26T16:10:00-05:00",
    "content": [
        "<p><a href=\"http://lh4.ggpht.com/__BBcPvPuMhA/S19Zq1xpHdI/AAAAAAAAAOM/WYLflpXb4MQ/WP-pencil.png\" imageanchor=\"1\" style=\"clear: right; float: right; margin-bottom: 1em; margin-left: 1em;\"><img border=\"0\" height=\"200\" src=\"http://lh4.ggpht.com/__BBcPvPuMhA/S19Zq1xpHdI/AAAAAAAAAOM/WYLflpXb4MQ/WP-pencil.png\" width=\"123\" /></a>A sad fact about computers is that they do what you tell them.  And only that they do what you tell them.  This fact may be good in the sense that we don't need to worry about any computer uprisings for the near future.  However, the fact that computers only do as they're told can be an enormous problem, especially with human error.\n</p>\n",
        "<p>Our local school district recently migrated to a new system for grading, attendance, and scheduling because the previous software maker folded due to financial problems.  Most of the kinks have been worked out, but, as recently discovered, there was a massive human error that impacted the grades of anyone attending our school system.  What's worse was that it was (mostly) out of the hands of the teachers and completely out of the hands of students so any problems needed to be addressed by the district technicians; once the issues are discovered.  Grades are kept track of completely by computer and all teachers are required to submit grades via the software that the district uses.\n</p>\n",
        "<p>Someone, somewhere, noticed some inconsistencies with grades that were already considered final for previous marking periods and the issue was investigated thoroughly until a problem was found with the configuration of the software that keeps track of all of us students.  Due to the fact that grades are maintained by software there was a problem, as most teachers no longer keep written records;  and only one set was necessary in order to get all 4,000 or so student grades straightened out.\n</p>\n",
        "<p>Back to the old, reliable pen and paper method of grading.  One teacher at my high school has been teaching for about 50 years and has never trusted the school computer system; or any technology for that matter.  This works in the favor of every student in the system, as it would appear.  The administration is aware that she keeps a pen and ink gradebook and transfers the information to the computer regularly and went to her to borrow her gradebook.  From this information for only a few hundred (if even that many) students, the technicians in charge of the system were able to fix all of the problems.\n</p>\n",
        "<p>Due to human error, student grades were impacted, though we're not told specifically how.  Had it not been for a handwritten gradebook, this rather major mistake was successfully reversed.\n</p>\n",
        "<p>Never underestimate the power of a pen and paper for reliability.  You just can't screw up its configuration no matter how hard you try.\n</p>\n"
    ],
    "tags": "computer, data, life",
    "date": "January 26, 2010",
    "title": "Back to the pen and paper"
}