{
    "title": "Simplicity Vs. Security",
    "tags": "internet, life, security, privacy",
    "date": "January 6, 2010",
    "content": [
        "<p><a href=\"http://lh6.ggpht.com/__BBcPvPuMhA/SxrbdyL07KI/AAAAAAAAAIg/QBtchKNJD3E/padlock.png\" imageanchor=\"1\" style=\"clear: right; float: right; margin-bottom: 1em; margin-left: 1em;\"><img border=\"0\" src=\"http://lh6.ggpht.com/__BBcPvPuMhA/SxrbdyL07KI/AAAAAAAAAIg/QBtchKNJD3E/padlock.png\" /></a>\n</p>\n",
        "<p><b>Statement 1:</b>  It takes longer to type and remember complex passwords with characters such as @,#,$,%, etc.\n</p>\n",
        "<p><b>Statement 2</b>:  The general recommendation for passwords states that they should have complex characters.\n</p>\n",
        "<p>From my experience, this leads to a compromise for some users- ease of use rather than security.  I am online on mobile devices a significant amount of time myself, and my Facebook especially reflects the fact in my status updates; \"Via Facebook Mobile\"\n</p>\n",
        "<p>The issue is that ease of use seems to often take a higher priority than security for many people.  As mobile devices with admittedly crappy keyboards become increasingly prevalent, crappy passwords follow.  That's not to say that all mobile devices are difficult to type on since more and more sport full QWERTY keyboards in some form or another.  Remembering and typing also plays a role- obviously it's much easier to remember a simple (and easily hackable) password such as 'letmein' instead of a stronger password such as L3+mE!n.\n</p>\n",
        "<p>Another issue is that passwords should be changed somewhat often- an issue for those with bad memories.\n</p>\n",
        "<p>Forgetting (for the moment) about newer technologies such as fingerprint recognition and facial recognition, there are ways to make strong passwords that are easily remembered by creating a pattern.  To log into the site example.com you might do something like;\n</p>\n",
        "<p>PWD  (capital letters with the abbreviation for password)\n</p>\n",
        "<p>4 (a number)\n</p>\n",
        "<p>example (name of site, easy to remember, lowercase letters)\n</p>\n",
        "<p>.(om (looks like .com, has two characters- a . and a ( )\n</p>\n",
        "<p>Which results in the password: PWD4example.(om.\n</p>\n",
        "<p>(Note that there's far better ways to make a password, the idea was simply to use a pattern).\n</p>\n",
        "<p>Keep your passwords strong and your online world safe.  There's nothing more devastating than losing accounts to hackers.\n</p>\n"
    ],
    "datestamp": "2010-01-06T20:13:00-05:00"
}