{
    "content": [
        "<p><a href=\"http://lh3.ggpht.com/__BBcPvPuMhA/S00FCfQoTsI/AAAAAAAAANA/mDCbm1GVkOE/googleCROP.jpg\" imageanchor=\"1\" style=\"clear: right; float: right; margin-bottom: 1em; margin-left: 1em;\"><img border=\"0\" height=\"200\" src=\"http://lh3.ggpht.com/__BBcPvPuMhA/S00FCfQoTsI/AAAAAAAAANA/mDCbm1GVkOE/googleCROP.jpg\" width=\"187\" /></a>\n</p>\n",
        "<p>Google has announced that it may shut down Google.cn, its site for Chinese users after some attacks on GMail originating in China.  The attacks happened in December 2009 and some intellectual property was stolen from Google; from my understanding there were no user compromises other than a specific few.\n</p>\n",
        "<p>As with any other online company, Google experiences hacking attempts fairly often.  However, the attack from China was much more targeted, much more sophisticated, and with a significantly different intent.  Other sites were attacked as well as Google, mainly those involved with the Internet, finance, technology, media and chemicals.  Appropriate authorities were notified and the affected businesses were/are being contacted about the security breach.  Google states that GMail accounts that were compromised in the attack were specific to human rights activists in China;  only two accounts were accessed and the only information stolen was the date of account creation and email subject lines.\n</p>\n",
        "<p>During the investigation into the incident it was noticed that dozens of accounts of US, China, and Europe human rights activists had been accessed by third-parties as well, though Google notes that these were <u>not</u> due to the attacks and were most likely due to phishing and malware attacks.  Google has already used information it gathered about the attacks to improve its security to ensure similar attacks may be thwarted.\n</p>\n",
        "<p>However, in this incident Google has fully publicized some information due to the impact it could have on human rights and security and especially, the issue of freedom of speech.  Not only that, but it has caused Google to reconsider its position on China.\n</p>\n",
        "<p>In 2006, Google launched Google.cn, a censored Google for use by the Chinese, with the intention of improving the Chinese peoples' access to information, stating at the time that they would monitor conditions in China and if they were not able to achieve their objectives that they would shut down Google.cn.  Straight from the Google Blog:  This could very well mean that Google will remove their presence from China, following other sites that have pulled out of China such as Facebook and Yahoo.\n</p>\n",
        "<p><blockquote><i>These attacks and the surveillance they have uncovered--combined with the attempts over the past year to further limit free speech on the web--have led us to conclude that we should review the feasibility of our business operations in China. We have decided we are no longer willing to continue censoring our results on Google.cn, and so over the next few weeks we will be discussing with the Chinese government the basis on which we could operate an unfiltered search engine within the law, if at all. We recognize that this may well mean having to shut down Google.cn, and potentially our offices in China.</i>\n</p>\n",
        "<p></blockquote>\n</p>\n",
        "<p>This could very well mean that Google will remove their presence from China, following other sites that have pulled out of China such as Facebook and Yahoo.  Despite the unfortunate repercussions on China's Google users, this effort shows Google's attention to the security of its users, possibly removing its presence from a country with billions of potential consumers in order to ensure the security of its users elsewhere around the globe.\n</p>\n",
        "<p><i>(From the Google blog: <a href=\"http://googleblog.blogspot.com/2010/01/new-approach-to-china.html\">http://googleblog.blogspot.com/2010/01/new-approach-to-china.html</a>)</i>\n</p>\n"
    ],
    "tags": "communications, google, internet, news, privacy, security, world",
    "date": "January 13, 2010",
    "title": "Google's New Position on China",
    "datestamp": "2010-01-13T17:01:00-05:00"
}