{
    "datestamp": "2010-04-02T21:43:00-05:00",
    "title": "I dare you to give this a thought",
    "date": "April 2, 2010",
    "tags": "computer, internet, life",
    "content": [
        "<p><a href=\"http://picasaweb.google.com/lh/photo/hWWWbeuv_igI6Bxz75A_5g?authkey=Gv1sRgCI_7q_HfyrGKmQE\" imageanchor=\"1\" style=\"clear: right; float: right; margin-bottom: 1em; margin-left: 1em;\"><img border=\"0\" src=\"http://4.bp.blogspot.com/__BBcPvPuMhA/SxrciGFLF1I/AAAAAAAAAIk/q79VQ13ceyA/s1600/chat.png\" /></a>Many of us spend a lot of time online.  Or, more accurately, an insane amount of time online.  As with everything, there's the good and bad of that and more so, those who enjoy every moment of it, and those who would like to get as far away from it as possible.  Where we belong- be it online or off, depends on the person.\n</p>\n",
        "<p>Personally, as someone who does spend an insane amount of time on the computer, and being 17 I have grown up with it, most people would be amazed to know that I don't intend to go to school for computers, nor do I enjoy spending insane amounts of time online.  In actuality, I try to avoid it- I didn't used to, but it hit me in a rather \"epic realization\" that the Internet is not my place.\n</p>\n",
        "<p>I go running almost every day, usually more than 2 miles.  I look forward to the family vacation at a lake-front cottage every summer.  Not because I get to spend [more] time with my family, not because I get to go canoing or swimming, but because I don't have a computer with me.  There is no Internet there, phone service is spotty (for best service, take the canoe to the middle of the lake), there's no game systems, and during our stay we don't use the TV.  Why do I spend so much time online then?  For me, it was fitting in, being a person beyond real life, having an identity.  I know how to build an online identity, I have over 300 Google results to my online nickname and I top the Google results for my full name- it's the result of about 2 years of work.  However, I don't need to have a massive following online, I have something better; good friends in real life.\n</p>\n",
        "<p>Why are you online?\n</p>\n"
    ]
}