{
    "content": [
        "<p><a href=\"http://stein.bioch.dundee.ac.uk/%7Echarlie/layman/BrownBrickWall_tileable.jpg\" onblur=\"try {parent.deselectBloggerImageGracefully();} catch(e) {}\" style=\"clear: right; float: right; margin-bottom: 1em; margin-left: 1em;\"><img alt=\"\" border=\"0\" height=\"200\" src=\"http://stein.bioch.dundee.ac.uk/%7Echarlie/layman/BrownBrickWall_tileable.jpg\" style=\"float: right; margin: 0pt 0pt 10px 10px;\" width=\"200\" /></a>\n</p>\n",
        "<p>As the Internet has become an almost essential part of life for many people, it has inevitably gained its negative side as well.  Aside from simply being the valuable research tool it is, there are also the hackers and \"bad guys\" online, as well as porn sites and whatnot, which are all side effects of how our society runs and how open the Internet is.\n</p>\n",
        "<p>Having made its way from large corporations, to homes, and now to public places such as school and libraries, the idea of filtering or blocking certain sites has been introduced, which, for such places, is extremely important.  Public places should never be used for extremely personal matters such as looking at \"dirty\" things on the Internet.  However, the question of whether or not to filter has spread to Internet Providers, some of which have mentioned possibly blocking certain web sites in the future, which makes Internet filtering a very relevant topic.\n</p>\n",
        "<p>Though filtering is important to prevent inappropriate information from reaching the eyes of underage kids, there is a time when it just becomes too much and is simply unethical.  Internet providers, though they have the capability, should not filter the information that they pass to homes.  In private places the user should be able to choose what should and should not be allowed into their home, not the people who provide a service.  Such behaviour could be compared to the phone company screening a person's phone calls before they reach their home.\n</p>\n",
        "<p>Schools, however, do reserve the right to filter Internet content, but they too overstep their boundaries at times.  In my school district, it is impossible to search for even the most innocent topic without encountering numerous blocks.  Recently, there has been some stir over a newly blocked site, \"Dropbox\" (<a href=\"http://getdropbox.com/\">http://getdropbox.com</a>) which is an online file storage site, great for moving files between home and school.\n</p>\n",
        "<p>Whether or not certain filtering is ethical or not is really up to the person subject to the filtering.  Some cases where filtering is ethical would be:\n</p>\n",
        "<p><ul><li>In schools or where kids need to use computers for a specific purpose\n</p>\n",
        "<p></li>\n</p>\n",
        "<p><li>In workplaces where Internet needs to be used for specific purposes</li>\n</p>\n",
        "<p><li>In places where criminal activity such as hacking has been proven to have originated from</li>\n</p>\n",
        "<p><li>In places where unfiltered Internet could be a risk to national security</li>\n</p>\n",
        "<p></ul>and on the other hand, unethical reasons and places for Internet filters:\n</p>\n",
        "<p><ul><li>Home or private Internet use</li>\n</p>\n",
        "<p><li>Blocking online storage (where it's not a danger to anyone)</li>\n</p>\n",
        "<p><li>For racist or communist reasons (blocking access to web sites because they pertain to certain groups or educating about the world [think China])</li>\n</p>\n",
        "<p><li>Promoting or demoting certain beliefs or ideas</li>\n</p>\n",
        "<p></ul>While some of those reasons may seem somewhat large or outlandish, they do exist and, unfortunately, I've seen them happen.  The ethical issues that ensue from certain areas, such as whether or not to filter Internet access appear due to changing society and changing technologies.  What's more, many people choose to be ignorant about the topic, thinking that it will simply blow over and vanish.  Most issues, such as this one, are here to stay and will constantly be debated.  Don't get me wrong, Internet filtering can be good and in some cases is important, but what's even more important is to be educated on the idea so that beneficial decisions can be made.\n</p>\n"
    ],
    "datestamp": "2010-02-24T20:29:00-05:00",
    "date": "February 24, 2010",
    "title": "The Ethics of Internet Filtering",
    "tags": "communications, computer, ethics, internet"
}