{
    "datestamp": "2011-07-20T19:43:00-05:00",
    "date": "July 20, 2011",
    "tags": "computer, linux",
    "content": [
        "<p><a href=\"http://4.bp.blogspot.com/-vX6V_txsAEA/Tidaa0IT88I/AAAAAAAAAe4/h4RTyjeJE9Q/s1600/sit3-shine.7.gif\" imageanchor=\"1\" style=\"clear: right; float: right; margin-bottom: 1em; margin-left: 1em;\"><img border=\"0\" height=\"200\" src=\"http://4.bp.blogspot.com/-vX6V_txsAEA/Tidaa0IT88I/AAAAAAAAAe4/h4RTyjeJE9Q/s200/sit3-shine.7.gif\" width=\"181\" /></a></p>\n",
        "<p><i>The Linux Foundation is celebrating the 20th anniversary of Linux this summer, from its humble start in 1991 to where it stands today as the operating system of choice for supercomputers, phones and many more things where speed, security, and reliability are required.&nbsp; Get in on the celebration at&nbsp;<a href=\"http://www.linuxfoundation.org/20th/\">http://www.linuxfoundation.org/20th/</a></i>.</p>\n",
        "<p>Outside of the more nerdy, technically inclined people like myself, Linux isn't extremely popular and isn't even well known.&nbsp; Windows vs. Mac OS X is the usual choice given in stores, and Linux only recently has gotten some publicity from companies such as Dell and Google.&nbsp; Given its past of being powerful but hard to use, the general opinion of Linux isn't too surprising even though it has become a misconception.</p>\n",
        "<p>Unfortunately, the selling point for Linux is usually that it's free and that it doesn't have viruses, both of which are generally true but are not the best things to take into consideration when trying to pick an operating system.&nbsp; Those two arguments seem to be the biggest arguments used when hard-core Linux fans try to \"convert\" users of OS X or Windows, even though they're not the most important reasons, and not the main reasons why Linux users such as myself run Linux as our system of choice.</p>\n",
        "<p>Really, the biggest and best reasons for running Linux are the independence, privacy, and reliability that any distribution of Linux comes with.&nbsp; In Linux, there is little question of if [Linux] software will work- it either does, or is fixed within a very short time to work because of the fact that it's open-source so anyone can develop software.&nbsp; Problems are fixed fast and if they aren't, there is nothing wrong with editing software yourself to fix it if you know how.&nbsp; The fact that Linux can work with almost any file you throw at it no matter how strange is also nice, so that when your cousin from Hogwarts emails you his homework, you can probably open it (assuming, of course, said cousin got around the fact that Muggle technology doesn't work inside Hogwarts).</p>\n",
        "<p>Due to the fact that Linux is open-source, there is a huge community online willing to help anyone with questions about anything, any time of day.&nbsp; The community is great, and had it not existed when I first became a Linux user, I probably wouldn't still be a Linux user because I had no idea how to set up everything to work on the old computer I was using- it took a while and some patience but I got it working.&nbsp; Generally, a lot of hardware \"just works\" under Linux (even the Kinect!).&nbsp; For anything that doesn't, you become your own IT person with the huge number of forums at your back, a fact that makes it much more satisfying and educational to solve problems.&nbsp; The open-source factor also makes Linux more secure because with an army of developers all over the world working on the software, there is no way for anyone to make any of the software malicious, simply because there's too many people to get it by.&nbsp; This happens to be one of the big reasons why the Russian government is switching to Linux and moving away from Windows.</p>\n",
        "<p>On the flip side, if you're at all timid when it comes to messing around with your computer and are unwilling to occasionally break or fix things, then Linux is generally not the best choice.&nbsp; There are, however, some newbie-friendly distributions that require less work, such as Ubuntu, so if you're willing to learn, there is a place to start.</p>\n"
    ],
    "title": "What's Up With Linux?"
}