{
    "tags": "data, dropquest, internet, security",
    "date": "January 18, 2011",
    "title": "Dropbox and Dropquest 2011",
    "datestamp": "2011-01-18T17:08:00-05:00",
    "content": [
        "<p><a href=\"http://3.bp.blogspot.com/__BBcPvPuMhA/TTYKqfwtC2I/AAAAAAAAAVo/v71kbJukYLg/s1600/dropbox.png\" imageanchor=\"1\" style=\"clear: right; float: right; margin-bottom: 1em; margin-left: 1em;\"><img border=\"0\" height=\"200\" src=\"http://3.bp.blogspot.com/__BBcPvPuMhA/TTYKqfwtC2I/AAAAAAAAAVo/v71kbJukYLg/s200/dropbox.png\" width=\"200\" /></a>I'm no stranger to online storage, I've cycled through Windows Live Skydrive, ADrive, Google Docs, Ubuntu One, and likely a few others that I can't recall.  As far as I'm concerned, I need a secure, reliable place to store my files where I can access them anywhere because I move between computers frequently for various reasons.\n</p>\n",
        "<p>Dropbox is, thus so far, my favorite of the online storage sites I've used and I seem to keep returning to it.  It's not the biggest; Dropbox only initially gives users 2 gigabytes, but provides opportunities for them to earn more.  My account currently is 6.75 gigabytes in size, all of which I've earned for free.  For some money, users can buy 50 or 100 gigabytes of storage space on Dropbox, or it can be won for free by participating in and winning Dropquest.  What it may not give in initial storage allotment, it does make up for in features.\n</p>\n",
        "<p>To my knowledge, it's the most secure of the aforementioned storage services, as everything on the site is encrypted.  The entire Dropbox website uses an https (secure) connection.  Any files stored on the service are accessible by their owner(s) only, as they're also encrypted on the site to a degree where not even those working at Dropbox are able to access them other than basic metadata (size, name, type).  In all honesty, files stored on Dropbox are probably safer than they are on your own computer due to Dropbox's numerous safeguards.  I find that I trust my files to Dropbox moreso than other services.\n</p>\n",
        "<p>As far as accessibility goes, Dropbox's file synchronization software (optional, but it's really nice to have) will run on Linux, Windows, Mac OS X, and there are apps available for it on Android, Blackberry, and iPhone/iPod/iPad and likely others that I haven't looked into.  Uploading a file with the desktop software is as simple as dragging it into the Dropbox folder, and it acts just like any other folder so making and deleting files and folders isn't any different.  Although the web interface doesn't allow for editing the contents of a file, it does allow for moving, renaming, and deleting files without any problem and even sharing them securely with a link or specific other people, in many cases without downloading the file.  As with any other website, the web interface can be accessed from anywhere on the planet, including mobile devices, for uploading or downloading files without the software as well, so it really is as they advertise: a virtual flash drive.  Files and folders can be selectively synced with any computer that Dropbox's software is installed on and there are instructions around online for setting up scripts to do various things; such as printing anything dropped into a certain folder or even setting up personal Wikis.\n</p>\n",
        "<p>Dropbox recently has been much more prominent online due to <a href=\"https://www.dropbox.com/dropquest2011\">Dropquest 2011</a>, which was a competition for extra storage space and physical gear such as Tshirts and hoodies.  I participated in and finished Dropquest, though I wasn't the first (#6361) so I earned another gig of storage space for my Dropbox as does anyone else who participates in and finishes.  If nothing else, giving Dropbox a try just for participating in Dropquest seems worth it in my personal opinion because it's a very well thought out online scavenger hunt.  It can take a while, but there's a lot of mental puzzles to solve and in the end there is still the extra 1 gigabyte to be won.  The competition was actually so popular that it brought down the Dropbox forums due to a widespread misconception about how to solve step two.  And just as a hint, for step 28, you need to cut out the paper and fold it into a crane in order to find the math problem to solve.  There are instructions online for getting through Dropquest, but for the sake of competition, I won't post a link.\n</p>\n",
        "<p>If you intend to sign up for Dropbox and give it a try, using this link to sign up: <a href=\"http://db.tt/ZRLTJjm\">http://db.tt/ZRLTJjm</a> will give you an extra 250Mb of space for being referred. \n</p>\n"
    ]
}
