{
    "datestamp": "2011-06-15T23:16:00-05:00",
    "content": [
        "<p><a href=\"http://4.bp.blogspot.com/-J3gXf6RbSIg/TcB6xAjIKiI/AAAAAAAAAZQ/huAPP_XL91A/s1600/launcher.png\" imageanchor=\"1\" style=\"clear: right; float: right; margin-bottom: 1em; margin-left: 1em;\"><img border=\"0\" height=\"179\" src=\"http://4.bp.blogspot.com/-J3gXf6RbSIg/TcB6xAjIKiI/AAAAAAAAAZQ/huAPP_XL91A/s320/launcher.png\" width=\"320\" /></a>Every new \"era\" in computing starts a new battle between the large companies.&nbsp; Everything from simply going online (at one point in time, not so simple), to the interface we're familiar with on our computers has gone through the battle of the companies, generally the \"big names\" in software such as Google, Apple, Microsoft and the like.&nbsp; The latest issue appears to be one that will impact everyone who keeps up with the latest trends in software, one that has already started but hasn't gained a lot of speed in terms of publicity yet.&nbsp; Apple pioneered the so-called \"Tablet War\" with the iPhone/iTouch and a little more recently, the iPad, and they are currently the best selling tablet on the market.&nbsp; Android from Google is available on tablets and phones as well, giving Google a place as the other major contender.</p>\n",
        "<p>However, due to the divide between the personal computer and the tablet, issues are arising with how the new interface is rolled out, as it appears that the new touch-friendly interfaces are already here - Gnome 3, OS X Lion, and possibly in fall 2012, Windows 8 - but not necessarily on tablets.&nbsp; Although the current \"desktop\" interface that everyone is familiar with isn't considered \"tablet-friendly\", the tablet interface that is coming seems to be notably less friendly when it comes to desktops with regards to efficiency and ease of use.&nbsp; Having used Windows tablets dating back to XP and more modern tablets such as the iPad (and PalmOS Garnet, technically), I can say from personal experience that the XP desktop on a tablet wasn't at all painful, but that I would never want to be forced to use the iPad interface on a desktop, simply because of the way I work.&nbsp; Not, of course, that I dislike tablets, I just dislike being forced to use a tablet with a mouse and no touch input.</p>\n",
        "<p>Currently, Gnome 3 and Ubuntu's Unity have \"fallback\" or \"classic\" modes which make the old desktop-style interface available, and it appears that Windows 8 may have a similar option.&nbsp; All three have interfaces clearly inspired by the touch interfaces of phones; Gnome 3 and Unity have the best of all the mobile-world, Windows 8 will have the best of Windows Phone 7 (which is great on a phone, I will add), and OS X Lion has the best of the iPad.&nbsp; With the tablet war raging on, it seems that touch is \"in\" even at the cost of handicapping those who lack actual touch input.&nbsp; As much as I love Gnome 3's new interface, managing more than a few windows with a mouse is utterly frustrating and inefficient no matter how well it works on a touch screen.&nbsp; As we move away from the mouse and cursor interface of computers (not that it does me much good anyway, I can never find the damn cursor on my screen), it will be interesting to see how the gap between touch and non-touch computers is bridged without alienating users.&nbsp; I, for one, enjoy having a taskbar.</p>\n"
    ],
    "tags": "mobile, tech",
    "date": "June 15, 2011",
    "title": "Losing the Cursor"
}