{
    "tags": "communications, facebook, google, internet, review, social networking",
    "date": "June 30, 2011",
    "title": "The Lowdown on Google+",
    "datestamp": "2011-06-30T22:34:00-05:00",
    "content": [
        "<p><a href=\"http://4.bp.blogspot.com/-bYjhOFMk-C0/TgyG05fMudI/AAAAAAAAAck/jxQLgErZUyg/s1600/google_plus_android_logo.png\" imageanchor=\"1\" style=\"clear: right; float: right; margin-bottom: 1em; margin-left: 1em;\"><img border=\"0\" height=\"200\" src=\"http://4.bp.blogspot.com/-bYjhOFMk-C0/TgyG05fMudI/AAAAAAAAAck/jxQLgErZUyg/s200/google_plus_android_logo.png\" width=\"200\" /></a>Google has made a few attempts to get into the social networking market, particularly to compete with Facebook, but thus far has seen limited success.&nbsp; Google Buzz was nailed over privacy concerns, Google Orkut never caught on, and Google Wave was a dismal failure.&nbsp; Google's latest stab at social media is Google+ (Google Plus).&nbsp; Currently, it is invite only and Google took down invites temporarily so only those who were invited are able to use the network, making it seem pretty exclusive.</p>\n",
        "<p>Unfortunately, Google stands at a disadvantage with Google+ given the fact that Facebook and Twitter are already well-established, and Google's previous attempts at social networking never caught on and were never really liked.&nbsp; However,  it appears that they have been busy introducing new features across Google as a foundation for Google+ for a while now, and with great results. &nbsp; The new +1 button for sharing sites in search results and articles from blogs takes the place of Facebook's 'like' button, Google's services are tightly integrated so there's no migration if you happen to use Google (your pictures, videos, profile, and buzz are already there for you), and there is a very slick integration across Google.&nbsp; The new upper bar introduced yesterday across Google holds notifications, a link to your profile, circles, privacy, and the usual account settings, so browsing Google doesn't take you away from what's going on on Google+.</p>\n",
        "<p>The site itself is very intuitive to use as it has the familiar aspects of Facebook at first glance, making it easy to navigate, but also improves greatly in places that Facebook made overcomplicated. &nbsp; The equivalent to Facebook's \"lists\" is \"circles\" which is used simply by dragging and dropping friends between \"circles\", then sharing posts with specific circles.&nbsp; Circles is much better than Facebook's privacy because there is no digging through settings to find it, as it is an integral part of Google+, much as privacy should be.&nbsp; Right now there are no \"Fan Pages\", \"Events\", or \"Apps\" as Facebook calls them, but it does make for a much cleaner experience.&nbsp; Some of these features will likely be added over time via other Google services such as Events via Google Calendar, for example, but I find that at least for now, I don't miss them.</p>\n",
        "<p>Google more than makes up for any missing features with group video chat   that Google calls \"Hangout\" , something that has been long-demanded from Facebook.&nbsp; It uses the Google TalkPlugin which was released for use with Google Voice for in-browser phone calls, so the framework is already there and in the case of a lot of users, is probably already installed.&nbsp; I had a hangout with 4 of my friends last night and I didn't have any problems with it, though its habit of switching the main video to the person talking is a bit seizure-inducing (stopped by clicking one of the video thumbnails under the main video).</p>\n",
        "<p>It seems that despite being the underdog,  Google+ has a very good chance of catching on, at least if the fury of searching for invites is any indication, and because getting started on it is as simple as it is. &nbsp; I have 8 friends in my Circles as of now, which won't grow until another wave of invites is available or Google opens the service, and I have more reason to sit on Google+ than Facebook (150 friends).&nbsp; The service is great and the fury of searching for invites is definitely not unwarranted.&nbsp; To jump start your Google+ presence, try the +1 button under this post if you're visiting on The Philosophy of Nate.</p>\n"
    ]
}