{
    "content": [
        "<p><a href=\"http://4.bp.blogspot.com/-vX6V_txsAEA/Tidaa0IT88I/AAAAAAAAAe4/h4RTyjeJE9Q/s1600/sit3-shine.7.gif\" imageanchor=\"1\" style=\"clear: right; float: right; margin-bottom: 1em; margin-left: 1em;\"><img border=\"0\" height=\"200\" src=\"http://4.bp.blogspot.com/-vX6V_txsAEA/Tidaa0IT88I/AAAAAAAAAe4/h4RTyjeJE9Q/s200/sit3-shine.7.gif\" width=\"181\" /></a></p>\n",
        "<p>The release of kernel 3.0 in the Linux world was effectively downplayed by a good portion of the Linux world as \"just another update.\"&nbsp; And they're right- the version was going to be 2.6.40, until Linus Torvalds switched it to 3.0 to commemorate the 20th anniversary of Linux.&nbsp; In that sense, no, Linux 3.0 was not a big deal as far as the 44 million lines of code in the kernel were concerned.&nbsp; It only added the usual collection of drivers and bug fixes.</p>\n",
        "<p>However, 3.0 is, from a publicity standpoint, a huge milestone for Linux in a lot of ways.&nbsp; It shows, among other things, that Linux is continuing to grow and evolve and is a viable piece of software.&nbsp; The fact that the version number was bumped to 3 could have made much more of an impact on the non-Linux world than it actually did- understandably, few people would care to hear that Linux hit version 2.6.40, but jumping a whole number is considered a big deal.&nbsp; Windows has moved to that scheme- Windows 7, Windows 8- as has Firefox, jumping from 3.x to 4, then 5, and now 6, with 7 to be released at the end of September.&nbsp; It makes for good marketing when users can brag about using a higher number, whether or not that number means a lot technologically.&nbsp; Even someone such as myself, who is aware of the marketing and its use, is affected by it.&nbsp; As soon as Linux 3.0 was released, I spent a long, impatient week or so waiting for it to show up on my own computer.</p>\n",
        "<p>Kernel 3.0 even makes some waves in the software world where the change is known to be (from the developer standpoint) fairly insignificant.&nbsp; Due to version numbers, developers and hardware manufacturers have been able to claim Linux compatibility to the latest version without actually updating the Linux side of their software.&nbsp; \"Supports Linux 2.x.x\" has appeared on software support information for some time now even if that particular software was made 5 years ago or more.&nbsp; The version number jump breaks that scheme, not only from the packaging standpoint, but from a programming standpoint as scripts that check kernel versions will be met with a shiny, new, confusing \"3.0.2\" (as it stands now in Arch) rather than 2.x.x.</p>\n",
        "<p>So what was the deal with 3? Technically, nothing out of the ordinary (though it now has drivers for the Kinect!).&nbsp; Out in the world, it was a different story and could have made for some great news from the world of the kernel.&nbsp; It's hard not to be interested when you hear \"Linux 3.0 is out- with Kinect support!\"</p>\n"
    ],
    "tags": "linux, news",
    "datestamp": "2011-09-19T23:22:00-05:00",
    "title": "Linux 3.0 Is A Big Deal (Kind Of)",
    "date": "August 19, 2011"
}