{
    "datestamp": "2011-11-08T04:00:00-05:00",
    "content": [
        "<p><a href=\"http://1.bp.blogspot.com/-5HRaD48LHaU/SzKtlERTFPI/AAAAAAAAALY/SY5TJdfOmOY/s1600/microsoft-logo.png\" imageanchor=\"1\" style=\"clear: right; float: right; margin-bottom: 1em; margin-left: 1em;\"><img border=\"0\" height=\"184\" src=\"http://1.bp.blogspot.com/-5HRaD48LHaU/SzKtlERTFPI/AAAAAAAAALY/SY5TJdfOmOY/s200/microsoft-logo.png\" width=\"200\" /></a></p>\n",
        "<p>If not for the Microsoft/Linux rivalry, Microsoft's new Secure Boot would probably not have made a huge splash in headlines until it was advertised as a feature of Windows 8 certified hardware.&nbsp; However, the implications of Secure Boot could be much farther reaching than Microsoft likes to admit, should it be implemented in a - and the Linux fan in me comes out - typical Microsoft fashion as far as Linux is concerned.</p>\n",
        "<p>The advertised idea of Secure Boot is to eliminate some of the security issues with not locking down the boot process of Windows, as some malware takes advantage of this time to get itself past other security.&nbsp; This takes a very similar approach as a lot of mobile devices (think- iPhone), which makes said devices extremely difficult to hack since the software is locked down on a hardware level.&nbsp; Secure Boot enabled systems would do something very similar, by only allowing software with keys that have been whitelisted (the installed operating system), to run at boot.&nbsp; There is nothing that would prevent alternative operating systems from also being whitelisted by the user, in theory, but if Microsoft has its way then that will likely not be an option.</p>\n",
        "<p>While unquestionably improving security, Secure Boot has some concerning aspects, particularly with Microsoft's typical practices with competing software.&nbsp; Windows 8 will require hardware manufacturers to lock down systems before selling them, which would lock the future owner of the system out of changing any aspect of the system outside of Windows.&nbsp; This would prevent owners from installing any Windows alternative, either in place of or in addition to Windows, such as Linux, Mac OS X (for those who like to run it on PC hardware), and the like.&nbsp; This lock-in may not concern the majority of people, who likely won't change anything drastic about their PC, but for those who do, it could be extremely bad news.&nbsp; It also brings about a new situation in the tech world as the average consumer is put at the mercy of Microsoft; made worse by the fact that Secure Boot could drive up the cost of computers since the new system could require individual attention for each system shipped.</p>\n",
        "<p>With that said, Secure Boot could, if done right, significantly improve security without screwing over any consumers.&nbsp; Canonical (Ubuntu), Novell, and Red Hat are taking on Microsoft's Secure Boot not to make sure it never sees the light of day, but to instead change some of its specifications.&nbsp; Ideally, Secure Boot would solve some security issues without completely locking hardware owners into Windows 8, giving more control over what happens at boot.</p>\n"
    ],
    "date": "November 8, 2011",
    "tags": "computer, linux, microsoft, security, windows",
    "title": "What's Up With Secure Boot"
}