{
    "title": "How the Internet is crucial in a crisis",
    "content": [
        "<p><a href=\"https://lh5.googleusercontent.com/-tzsRogg47fg/Sxre-GQunCI/AAAAAAAAAIs/-5ea7JSJn44/s1600/wireless.png\" imageanchor=\"1\" style=\"clear: right; float: right; margin-bottom: 1em; margin-left: 1em;\"><img border=\"0\" src=\"https://lh5.googleusercontent.com/-tzsRogg47fg/Sxre-GQunCI/AAAAAAAAAIs/-5ea7JSJn44/s1600/wireless.png\" /></a>On any normal day, the Internet undoubtedly brings us closer together; we stalk our friends on Facebook, follow celebrities on Twitter, and read the various blogs that we enjoy being kept up to date on.  It bridges the gap between our local friends and family and those who are farther away, across an ocean, for example.  For the most part, the Internet has reached a point in our minds where it is taken for granted and it's just one of those things that for those of us in more privileged countries always have at our disposal.\n</p>\n",
        "<p>The true power of the Internet and our ability as people to band together with it at our disposal is never recognized until a crisis strikes; the recent rebellion in Egypt, or the earthquake in Japan, for example.  In Egypt, the people used social sites as a means of organizing their protests, and it was such a powerful tool that not only did they succeed, for a large part, but the government shut down broadband Internet for a period of time, knowing that it was being used in that manner.  A France-based dialup provider even offered free Internet access to those in Egypt (who were able to find the information online).\n</p>\n",
        "<p>Even more recently was the earthquake in Japan.  The primary source for news was the Internet, between Google Realtime and Twitter.  Google opened its PeopleSearch service for those in Japan to locate their family and friends and to post information about themselves so that their family and friends could locate them as well, not to mention that those who were left with more access to the Internet were keeping in touch with friends from other, unaffected places.  I have a teacher who on the morning of was texting back and forth with someone she was close to in Japan in between her teaching.\n</p>\n",
        "<p>With that said, in a crisis, the Internet is a source for news for both those affected and those elsewhere around the globe.  Not only news sites, but firsthand accounts from those affected.  Information and aid are available much more readily to everyone, affected or not.  It's also a way to keep in touchand a source of help for those affected.  With the Japan earthquake, instructions on how to make solar powered lanterns surfaced on a few websites in hopes that they would be made and sent to Japan, as lack of light was a huge problem for those left stranded, for example.  Though it may not be available directly to those affected by a crisis for various reasons, power outages or damage to infrastructure that the Internet relies on, the Internet has become an indispensable resource, and seems to be growing in that role significantly as it becomes more accessible and more reliable. \n</p>\n",
        "<p>Crisis is somewhat of a broad term, however, and the Internet has also been involved in getting help to those in more isolated situations.  Facebook, Twitter, and instant messaging make it possible to silently call for help in any situation where being noticed may be dangerous or speaking simply isn't realistic.  Cases where people have called for help via Facebook seem to be becoming more frequent (<a href=\"http://mashable.com/2011/03/18/facebook-burglary-2/\">article</a>), and although some, as in the linked article, may have a valid reason for using the Internet that way since most areas don't have the ability to text emergency services [yet], it also raises the question of when it truly <i>is</i> a useful tool in an emergency rather than something that simply delays when help can arrive.  There is no doubt that the Internet has become an integral tool in any crisis and getting help for any sort of crisis is crucial, be it Japan after the earthquake or a burglary, but it may very well be that the Internet is best left for the \"really big\" crises rather than burglaries.\n</p>\n"
    ],
    "date": "March 17, 2011",
    "datestamp": "2011-03-17T18:56:00-05:00",
    "tags": "communications, internet, life, world"
}
