{
    "datestamp": "2011-08-09T22:05:30-05:00",
    "date": "August 09, 2011",
    "tags": "internet, news, safety, world",
    "title": "How To Run An Online Scam",
    "content": [
        "<p><a href=\"http://1.bp.blogspot.com/-PSTV5yZpLzM/SxrbdyL07KI/AAAAAAAAAIg/RpSaCqphs_Y/s1600/padlock.png\" imageanchor=\"1\" style=\"clear: right; float: right; margin-bottom: 1em; margin-left: 1em;\"><img border=\"0\" height=\"200\" src=\"http://1.bp.blogspot.com/-PSTV5yZpLzM/SxrbdyL07KI/AAAAAAAAAIg/RpSaCqphs_Y/s200/padlock.png\" width=\"200\" /></a>\n</p>\n",
        "<p>As much as it may appear otherwise, given a little time running an online scam isn't nearly as difficult as the general person likes to think.  This translates to the rest of us being required to be all the more vigilant about keeping ourselves safe and verifying anything, especially before sharing any personal information.\n</p>\n",
        "<p>Though there are scams running online all the time, some obvious, others not, one of the most recent ones that spread virally was about browser choice being indicative of a person's IQ.  The news article was picked up by various reputable news sites such as CNN, Telegraph, BBC and others and circulated for a few days.  I picked it up and mentioned it in the previous post on <i>The Philosophy of Nate</i> as well before anyone had any reason to question the results of the study, which conveniently seemed to make some sense.  Having been on CNN and the BBC, it seemed legitimate enough to me.\n</p>\n",
        "<p>Surprisingly little work went into putting together the scam- it was discovered a few days after the news story circulated that the research group running the study, \"AptiQuant,\" was, in fact, a fake.  The company's website went live not long before the scam, and apparently copied a lot of content from an existing, reputable website from a company based in France.  Employee pictures and site content were copied, though names were changed for the purposes of \"AptiQuant.\"\n</p>\n",
        "<p>The degree to which the Browser IQ story circulated with what seemed to be very little effort on the part of the scammers is a reminder to the rest of us to watch out for ourselves online and to check into the background of anything before we give out any sort of information (or rely on any information).  Although the \"AptiQuant\" scam was only an annoyance and embarrassment to those who covered it, many scams are far more than that and result in identity theft, hacking, or other data theft.  If anything seems questionable, check with the source yourself with your own information- call them or log in with your own web address rather than using the information given.\n</p>\n",
        "<p>And, of course, if you switched from Internet Explorer 6 because of \"AptiQuant\", your IQ is no lower than anybody else's- though you may want to keep your upgrade as IE6 isn't up to par with the security on newer browsers.\n</p>\n"
    ]
}
