{
    "content": [
        "<p><a href=\"http://4.bp.blogspot.com/-J3gXf6RbSIg/TcB6xAjIKiI/AAAAAAAAAZQ/huAPP_XL91A/s1600/launcher.png\" imageanchor=\"1\" style=\"clear: right; float: right; margin-bottom: 1em; margin-left: 1em;\"><img border=\"0\" height=\"177\" id=\":current_picnik_image\" src=\"http://4.bp.blogspot.com/-J3gXf6RbSIg/TcB6xAjIKiI/AAAAAAAAAZQ/huAPP_XL91A/s320/launcher.png\" width=\"320\" /></a>\n</p>\n",
        "<p>Those involved with Linux in any way have most likely caught wind of Gnome 3, a rewrite of the Gnome 2.x.x desktop environment.&nbsp; As of just a few days ago, Gnome 3 is considered to be fully out of testing and is available to Arch users, Fedora users, and others (Ubuntu is not included in the mix as they created their own environment, Unity).\n</p>\n",
        "<p>As Gnome 3 is going to fully replace its old 2.x.x counterpart, I adopted it in advance in order to get to know it and leave myself time to find a new desktop environment in case I didn't like it.&nbsp; Gnome 3 with gnome-shell is entirely different from the standard desktop that most of us are familiar with, and is most like what you would expect from an Android tablet or something similar rather than a desktop computer.&nbsp; There is, for all those who don't have hardware capable of 3D rendering that Gnome-shell requires, a fallback mode that is essentially the classic desktop that everyone is accustomed to.\n</p>\n",
        "<p>Gnome 3 struck me as being extremely easy to use, and probably the first noticeable changes are that it lacks a \"desktop\" and a taskbar.&nbsp; Losing the Desktop wasn't a huge change for me because I have never actually used my desktop except as another folder.&nbsp; The \"desktop\" has been replaced with a brand new launcher that smacks of Android, and functions a lot like the app screen that most smartphone owners are familiar with.&nbsp; Typing a few letters filters the list, and includes files that have relevant names.&nbsp; It is much faster than sifting through a menu to find an application; those that are used frequently will show up in the \"favorites list\" which is the dock-like area at the left of the screen.&nbsp; (Screenshot:&nbsp; <a href=\"https://lh5.googleusercontent.com/__BBcPvPuMhA/TcB6xAjIKiI/AAAAAAAAAZQ/mAzySreyQb0/s800/launcher.png\">Launcher</a>)\n</p>\n",
        "<p>The replacement for the taskbar is a full-screen list with previews of all the open windows, minimized or otherwise.&nbsp; Windows can be closed from that screen with a small X button that appears over windows (like iOS), so sifting through and closing windows is fast.&nbsp; From that screen, windows can also be dragged to other desktops (\"workspaces\" is probably more accurate) that appear in the right hand dock.&nbsp; Gnome 3 automatically adds extra desktops so that there is always a blank workspace available, though switching between them in dual monitors takes getting used to, as anything on the extra monitor travels between them as though it's a separate area unrelated to the workspaces.&nbsp; (Screenshot: <a href=\"https://lh4.googleusercontent.com/__BBcPvPuMhA/TcB9KPGzJsI/AAAAAAAAAZg/WsrpzPxBXHo/open_apps.png\">Window management</a>).&nbsp; At the bottom is the tray with running applications as is customary, though system functions such as battery, volume, accessibility and such are now permanently in the upper bar to the right.&nbsp; The launcher and window manager can be found by moving the cursor off the upper left corner of the screen or by clicking on \"Activities\".\n</p>\n",
        "<p>Notifications appear in the lower centre of the screen and are unobtrusive and overall more useful as things like instant messages can be read and responded to by hovering over the notification, which then vanishes when the mouse is no longer over it.&nbsp; Message boxes are tied to their respective application windows as well which for me took some getting used to but it makes sense.&nbsp;  The desktop seems to run much smoother and faster than Gnome 2.x.x  which always struck me as slightly bloated, even without the 3D effects.&nbsp; For the most part though, it's  easy to get used to using as it's extremely intuitive.&nbsp; There are, however, a  few things hidden away, such as the option to shut down- in the menu,  holding the \"alt\" key switches \"suspend\" to \"power off\".&nbsp; All in all though, it's definitely worth upgrading once it's available for your distro and if the new interface isn't to your liking, the fallback mode has the speed improvements but the look and feel of the classic desktop.&nbsp; Keep in mind that there is no downgrade path so if you run Ubuntu or another distro that doesn't have it in the repositories yet you are probably better off waiting (I killed my testing setup of Ubuntu with it).\n</p>\n"
    ],
    "datestamp": "2011-05-03T18:42:00-05:00",
    "title": "Reviewing Gnome 3",
    "date": "May 3, 2011",
    "tags": "linux, news, review"
}
