{
    "date": "July 7, 2011",
    "datestamp": "2011-07-07T00:10:00-05:00",
    "content": [
        "<p><a href=\"http://4.bp.blogspot.com/-bYjhOFMk-C0/TgyG05fMudI/AAAAAAAAAck/jxQLgErZUyg/s1600/google_plus_android_logo.png\" imageanchor=\"1\" style=\"clear: right; float: right; margin-bottom: 1em; margin-left: 1em;\"><img border=\"0\" height=\"200\" src=\"http://4.bp.blogspot.com/-bYjhOFMk-C0/TgyG05fMudI/AAAAAAAAAck/jxQLgErZUyg/s200/google_plus_android_logo.png\" width=\"200\" /></a>If the number of hacks, extensions, and suggestions on how to make Facebook more like Google+ is any indication, Google+ has drawn more than a small amount of interest across the web.  At the same time, pressure is increasing on Facebook to bring new features to Facebook that may not have even been considered in the past.</p>\n",
        "<p>The first, and probably most momentous indication of the pressure on Facebook is the announcement of Facebook's latest new feature; video chat via Skype.  Given the low-quality video and the lack of any distinguishing features, it seems clear that Facebook unveiled the new feature long before it was actually ready, not long after Google+ was announced.  In all likelihood it is not the last feature Facebook will announce prematurely due to pressure from Google.  I haven't tested Facebook's video chat myself (it runs only on Windows right now), but I have already heard complaints about the new chat interface as well as some notable testers such as ZDNet complaining about the quality.  With Facebook's own video chat, the feature battle between Google+ and Facebook has started.</p>\n",
        "<p>For now, Google's implementation of most of its features is far better than Facebook, enough to make Facebook seem extremely awkward after using Google+ for a while, which may be enough to keep users and to attract more.  Right now, Google has a few of the key things going for it to give it an upper hand in a competition with Facebook.  One of them is exclusiveness, which makes Google+ seem like a club to those outside of it and draws a significant amount of publicity.  From a marketing standpoint the now nearly entirely exclusive social network is doing just the right thing, building a huge amount of interest, even though the invite system is mainly a practical consideration.</p>\n",
        "<p>The other, something that Google has been successful with in nearly all its services, is a good implementation.  With all the interest surrounding Google+, it will undoubtedly be visited by a huge number of new users once it opens up- and already has, considering the invite link disappeared as I was in a Hangout due to massive demand.  A good service keeps users on the site.  The big indication of how Google+ could succeed is GMail's past.  GMail launched long before I was actively online for anything other than flash games, but started much like Google+ - and now is one of the top webmail providers online.  Google+ is at a huge disadvantage in the social area but with the introduction of some new features and an extremely good implementation of ones done poorly on Facebook, they may very well become the next Facebook, though with better privacy (damn! stalking just got harder!).</p>\n",
        "<p>Whether or not you are on Google+, there's some sites worth checking out:</p>\n",
        "<p><a href=\"http://www.circlehack.com/\">http://www.circlehack.com</a> - your Facebook lists, in Circle form</p>\n",
        "<p><a href=\"http://move2picasa.com/\">http://move2picasa.com/</a> - migrate your Facebook photos and albums to Picasa/Google Photos for Google+</p>\n",
        "<p><a href=\"http://bit.ly/pjJlyH\">http://bit.ly/pjJlyH</a> - Update your Facebook status from Google+</p>\n",
        "<p><a href=\"https://www.facebook.com/videocalling\">https://www.facebook.com/videocalling</a> - Enable Facebook video chat</p>\n"
    ],
    "title": "Google+ Takes on Facebook",
    "tags": "facebook, google, internet, social networking"
}