{
    "tags": "browsers, internet, news, review",
    "datestamp": "2011-03-24T18:30:00-05:00",
    "content": [
        "<p><a href=\"https://lh3.googleusercontent.com/-kBRCka3gyvs/TYvBnCs3cHI/AAAAAAAAAYg/6JmzyVSyuvo/s1600/firefoxlogo.jpg\" imageanchor=\"1\" style=\"clear: right; float: right; margin-bottom: 1em; margin-left: 1em;\"><img border=\"0\" height=\"193\" src=\"https://lh3.googleusercontent.com/-kBRCka3gyvs/TYvBnCs3cHI/AAAAAAAAAYg/6JmzyVSyuvo/s200/firefoxlogo.jpg\" width=\"200\" /></a>The latest and greatest in browsers (at least as far as publicity goes) is Firefox 4, which was just released a few days ago. As a heavy web user who is still trying to cut down on Internet time, I regularly max out my memory with some huge number of pages open in my browser of choice; generally Google Chromium (the open-source equivalent to Google Chrome). I love Chromium; it's fast, secure, and I can sync my bookmarks between multiple browsers, which for me is important since I regularly move between computers. It has never given me any real problems, which in my experience is fairly rare given the browsers I switch between.\n</p>\n",
        "<p>Shortly after the release of Firefox 4, as with all new software I can get my hands on, I upgraded the version on my system to run it through my browser-killing habits. Probably the best description I have for how I feel about it is \"impressed.\" I haven't been running it for long enough to experience any real issues, but it seems to run much more efficiently than Chrome; I'm writing this post from a Firefox 4 tab, alongside several dozen other pages and my memory usage is less than half of what it is when I do the same with Chromium. The only other performance difference is that pages appear to load slightly slower, but given the much smaller footprint compared to Chromium it's not particularly noticeable. Worth noting is that the slightly faster speed of Chromium may be due to my web cache, which Firefox has yet to build up.\n</p>\n",
        "<p>As for features, Firefox 4 has many of the same additions as there are in Chrome, some relatively new and others not. The most notable are that Firefox now is capable of hardware acceleration (though I'm not sure if that is the case on my system) and the new \"Pin App\" feature which lets users \"pin\" a web page as a button rather than a tab, similar to what you can do with the Windows 7 taskbar. I cannot speak for the features that older Firefox versions included, but there is now bookmark sync, themes, \"tab grouping\" (self explanatory), and extensions, to name a few more notable parts of the browser. Mozilla claims to have also made a unified menu so that the browser takes up less space on-screen, but the version on my system seems to lack that.\n</p>\n",
        "<p>As someone who is extremely picky about his software (even building his own at times), I highly recommend Firefox 4. Though I may stick with Chromium as my browser of choice, at least for the time being seeing as it's what is installed on all my systems and where my settings are stored, Firefox 4 is definitely worth a try, if nothing else but for the smaller memory footprint.\n</p>\n",
        "<p>Firefox 4 is available for download at<a href=\"http://www.mozilla.com/\">http://www.mozilla.com</a>, and you can read more about it at their website as well.\n</p>\n"
    ],
    "title": "First impressions of Firefox 4",
    "date": "March 24, 2011"
}
