{
    "date": "May 31, 2011",
    "tags": "communications, ethics, internet",
    "datestamp": "2011-05-31T21:51:00-05:00",
    "title": "Ad Blocking Ethics",
    "content": [
        "<p><a href=\"http://4.bp.blogspot.com/-tzsRogg47fg/Sxre-GQunCI/AAAAAAAAAIs/-5ea7JSJn44/s1600/wireless.png\" imageanchor=\"1\" style=\"clear: right; float: right; margin-bottom: 1em; margin-left: 1em;\"><img border=\"0\" src=\"http://4.bp.blogspot.com/-tzsRogg47fg/Sxre-GQunCI/AAAAAAAAAIs/-5ea7JSJn44/s1600/wireless.png\" /></a>As with essentially everything else in the modern world, the Internet fosters advertising; and has huge industries surrounding it.&nbsp; Given the young and evolving nature of the Internet the ad industry has undergone many changes and compared with its extremely sketchy past, improved significantly.&nbsp; Ads are now targeted and tracked - and censored, in some cases - so they are relevant and whatever happens to lie on the other end of the click is of use.</p>\n",
        "<p>Online advertisements have garnered a bad reputation, in large due to their past and in the case of some websites, their intrusiveness.&nbsp; Popup blockers are old news and are built in to any modern browser, though less due to the annoyance of popups than to the security risk they pose.&nbsp; Following the popup blockers though, have been browser extensions such as Adblock, which are built to block <i>all</i> online ads of any type.&nbsp; It appears that quite an industry is springing up around the blocking of advertisements, considering that the Adblock developer left his job and relies solely on profits from Adblock donations.</p>\n",
        "<p>The practice of blocking advertisements, though nothing new, is becoming so widespread that it is a problem  for a huge industry, not to mention the smaller websites that rely on revenue from ads to pay for their web space.&nbsp; Due to the reliance on ads - which for a large part are forgiveable and unintrusive - to support websites, ad blocking raises an interesting question of ethics; when is it permissible to block ads rather than simply ignoring those that aren't interesting?&nbsp; Given the huge effort that goes into tracking and targeting ads, ads have become more relevant and more reputable in most cases, and no longer hijack browser windows for attention (in most cases).</p>\n",
        "<p>Blocking ads appears to be becoming a standard practice, despite the fact that they are no longer a particular security threat and less effort is put into teaching new Internet users not to click them.&nbsp; Sites that rely on advertising revenue in many cases simply need the ads to be shown on the page, so blocking them means that there is no chance for the site to be paid.&nbsp; Removing ads from pages seems like a minor and beneficial choice, but in reality it hurts frequented sites.&nbsp;  Simply shutting off Adblock (or choosing not to block ads) is one of the best ways to support free sites  without directly donating money to them.&nbsp; Most free sites are supported by advertising revenue, which is worth keeping in mind while perusing the Internet.</p>\n"
    ]
}