{
    "date": "August 1, 2011",
    "datestamp": "2011-08-01T05:00:00-05:00",
    "content": [
        "<p><a href=\"http://1.bp.blogspot.com/-PSTV5yZpLzM/SxrbdyL07KI/AAAAAAAAAIg/RpSaCqphs_Y/s1600/padlock.png\" imageanchor=\"1\" style=\"clear: right; float: right; margin-bottom: 1em; margin-left: 1em;\"><img border=\"0\" height=\"200\" src=\"http://1.bp.blogspot.com/-PSTV5yZpLzM/SxrbdyL07KI/AAAAAAAAAIg/RpSaCqphs_Y/s200/padlock.png\" width=\"200\" /></a></p>\n",
        "<p>One of the most overlooked (and under-cared about) aspects of online privacy is what browsers say about their owners.&nbsp; Generally, web browsers transmit a lot of data about what browser they are, certain software/hardware capabilities, and software versions.&nbsp; Transmitting information such as this has its uses- websites can warn about out-of-date software, and software sites can direct visitors to the appropriate download for their system.&nbsp; It does raise some security and privacy concerns as it makes it easier to track people.&nbsp; Even I can admit to simply not caring what my browser says about me.</p>\n",
        "<p>With concern mounting regarding hacking and privacy, browser headers, as they're called, will probably be thought about much more by the average privacy-aware web surfer, especially with the new Internet tracking bill passed by the government.&nbsp; There are browser extensions that can hide or mask the information your browser sends to the Internet, but while doing this improves privacy (my browser, for example, is unique out of 1,692,860 tested browsers [panoptic.eff.org] making me very trackable) it can also prove to be an inconvenience as you won't receive the benefits of certain websites tailoring their site to your system.</p>\n",
        "<p><i>[It appears, however, that simply sharing the name and version of your browser of choice can say a lot about you as well (keep it quiet!).&nbsp; According to a study done by a Canadian company AptiQuant, your browser can also be an indication of your IQ.&nbsp; The conclusion developed from the study is that users of a lower IQ are less likely to upgrade or experiment with new software, hence the lower IQ of users of older web browsers, particularly Internet Explorer (if you by choice run Internet Explorer 6 in 2011, don't tell anyone!)</i></p>\n",
        "<p><i>The summary of results from the study show that users of Internet Explorer 6 have a low IQ close to 80, with users of later versions not faring much better, followed by Firefox in the low 100s, Chrome, Safari, Internet Explorer with Chrome Frame jumping past 120, then followed by Camino and Opera.&nbsp; Though \"what browser do you use\" is not likely to become a question on most college or job applications any time soon, it is information worth keeping in mind for bragging rights or secrecy, if nothing else.] - The organization running this test has been discovered as being a scam, and the test and its results having been fabricated with no actual science.</i></p>\n",
        "<p></p>\n",
        "<p><i><span style=\"font-size: x-small;\">Data from http://mashable.com/2011/07/29/internet-explorer-iq/ and https://panopticlick.eff.org/</span></i></p>\n"
    ],
    "title": "My Browser Said What?",
    "tags": "browsers, communications, internet, privacy, security"
}