{
    "content": [
        "<p><a href=\"http://4.bp.blogspot.com/-bYjhOFMk-C0/TgyG05fMudI/AAAAAAAAAck/jxQLgErZUyg/s1600/google_plus_android_logo.png\" imageanchor=\"1\" style=\"clear: right; float: right; margin-bottom: 1em; margin-left: 1em;\"><img border=\"0\" height=\"200\" src=\"http://4.bp.blogspot.com/-bYjhOFMk-C0/TgyG05fMudI/AAAAAAAAAck/jxQLgErZUyg/s200/google_plus_android_logo.png\" width=\"200\" /></a>Google+, particularly due to its current exclusiveness, has gained a huge appeal across the Internet if the demand for invites has been any indication.&nbsp; Fan pages have sprung up on Facebook for Google+ and its various features and it generally has been the latest big thing online, even finding itself a mention on FOX News.</p>\n",
        "<p>Due to the exclusiveness of Google+, it remains to be seen just how popular it will become and if it will actually grow in popularity to rival Facebook, as Facebook once did to Myspace.&nbsp; Google was forced to shut down its invite system given the huge demand for entrance into its social network which has simply created more demand; Google+ invites can now even be bought on Ebay.&nbsp; Meanwhile, Facebook has a developed network with over 130 million users and counting which makes it a formidable social network to compete with- one that until now has faced little direct competition.</p>\n",
        "<p>Google+, however, offers many of Facebook's features in a much more refined way while introducing some of its own.&nbsp; Hangouts, Google's group video chat, has been a feature long demanded from Facebook, while Google+'s friend Circles are a much more intuitive alternative to Facebook's criticized friend lists.&nbsp; Both of these features give Google an upper hand, while Google can also leverage its huge presence and many users that use various Google services.&nbsp; Already, Google's +1 buttons are all over the Internet, Google's web tools track \"+1's\", and anyone on any of Google's services has no setup as far as joining Google+ is involved since their data is already in place awaiting privacy settings.</p>\n",
        "<p>The main change may be Facebook's habit of treating users as commodities and catering instead to advertisers.&nbsp; Facebook has become notorious for adding features primarily for the benefit of advertisers, and ignoring requests of users for features, fixes, and in many cases simple acknowledgement of problems.&nbsp; Even if Google+ doesn't catch on in the long run, it will force changes to Facebook's procedures in order to avoid seeing large groups of users switch to Google as users become frustrated and migrate their circles of friends.&nbsp; Already, Google has the foundation through all its services to provide a clean, streamlined and secure service to compete against Facebook, and Google+ is still under development.&nbsp; In the long run, Facebook may see changes of its own in appearance, features, and its treatment of users that have been a long time coming.</p>\n"
    ],
    "title": "What Google+ Means for Facebook",
    "datestamp": "2011-07-05T00:21:00-05:00",
    "tags": "communications, facebook, google, internet, social networking",
    "date": "July 5, 2011"
}