{
    "date": "April 13, 2011",
    "content": [
        "<p><a href=\"http://lh6.ggpht.com/__BBcPvPuMhA/SxrciGFLF1I/AAAAAAAAAIk/q79VQ13ceyA/chat.png\" imageanchor=\"1\" style=\"clear: right; float: right; margin-bottom: 1em; margin-left: 1em;\"><img border=\"0\" src=\"http://lh6.ggpht.com/__BBcPvPuMhA/SxrciGFLF1I/AAAAAAAAAIk/q79VQ13ceyA/chat.png\" /></a>Over the last few years, social media has taken the Internet by  storm.  Myspace was among the first, and from there grew Twitter,  Facebook, and all the other sites that we hear mentioned on a regular  basis.  Every company and person seems to either be on one or more of  the major social networks or is making an effort to create their own  presence on them.  This storm of information posted online from everyone  trying to find their niche is easily picked up by search engines and  spreads around the Internet incredibly fast.\n</p>\n",
        "<p>For someone such as myself, who is currently applying to colleges  and jobs, things posted by either me or my friends can make or break  opportunities as many colleges/employers do Google applicants.  One of the worst things about social media is the general lack of privacy  from the start; Facebook's recommended settings leave a lot of things  fairly public, and every so often they revert custom privacy settings to  that.  Google was sued over its recent \"Buzz\" service that was  introduced to compete with Twitter because it published some user  information in a way that violated the company's own privacy policy.  Between poor recommendations for privacy and ongoing changes, privacy is  difficult to come by and even harder to maintain as far as posting  information anywhere online goes.  One of the best examples of this is  the fact that a huge number of Facebook Notes were published and are  still searchable in Google more than a year later.\n</p>\n",
        "<p>Another problem that we've all run into, or at least will at some point, is the lack of emotion.  Simply put, you can't judge emotions from text.  Most social sites now allow posting all manner of media either natively  or through third party sites, but it's extremely easy to misinterpret a  message because the face behind it is invisible.  To top it off, the Internet is addictive, and social media magnifies the effect;  it's extremely hard to keep up with friends without watching or  receiving notifications from Facebook.  There are \"Facebook Anonymous\"  programs where obsessive or addicted users can get coaching to curb  their Facebook habit;  one that's probably harder to kick than substance  addictions.\n</p>\n",
        "<p>Social media also gives us the opportunity to build up an identity for ourselves and hollow out our own little niche online.  As a blogger, I can say that the main part of my online identity  outside of my friends is a blog, and given my restrictive privacy  settings, it doesn't focus around Facebook or Twitter.  Social networks  give everyone an edge in promoting the positive aspects of themselves  and getting known; and potentially famous in their own ways.  Aside from  simply building egos, social sites also provide a powerful, fast way to keep in touch with friends and family around the globe. Distances start to seem much shorter with software such as Skype, with  video chat, or even just watching the Facebook posts of friends scroll  down the screen.  With a little care and some careful control on what's  posted and what's hidden, social media is a powerful tool with a lot of  potential uses, and is something that will undoubtedly become an  increasing part of our lives in the future.\n</p>\n"
    ],
    "title": "The Good and Bad of Social Networking",
    "datestamp": "2011-04-13T16:23:00-05:00",
    "tags": "communications, computer, facebook, internet, myspace, pros and cons, social networking"
}
