{
    "content": [
        "<p><a href=\"http://1.bp.blogspot.com/-PSTV5yZpLzM/SxrbdyL07KI/AAAAAAAAAIg/RpSaCqphs_Y/s1600/padlock.png\" imageanchor=\"1\" style=\"clear: right; float: right; margin-bottom: 1em; margin-left: 1em;\"><img border=\"0\" src=\"http://1.bp.blogspot.com/-PSTV5yZpLzM/SxrbdyL07KI/AAAAAAAAAIg/RpSaCqphs_Y/s1600/padlock.png\" /></a>With all the talk of phishing and hacking raging across the Internet like wildfire, it tends to seem inevitable that one day an incident will hit close enough to home for it to hurt, especially with all the information we tend to store online.  Most high-profile sites such as Google, Facebook, and even Twitter are continually rolling out site updates to counter attacks that in many cases are preventable.  As someone who has never had an account hacked but sees friends' accounts hacked multiple times a week, it seems to me that some of the simplest ways of staying safe online are ignored for ease of use or simply carelessness.  \n</p>\n",
        "<p>Make use of security settings.  Almost every major site has a setting for https which encrypts information flying between the site's servers and users.  Google turned https on by default for all GMail accounts after the China hacking incident, but nearly all Google services are now accessible via https.  Facebook recently rolled out https for the majority of the site, the option for which can be found in the account settings, and Twitter has the option as well.  Https prevents eavesdropping on communication with the site<i> </i>which is particularly important for public or unsecured connections, especially with software that makes it easy for anyone to pull login information without any hacking ability whatsoever, like a Firefox extension that I will not name.\n</p>\n",
        "<p>Read more ways to stay secure after the break.\n</p>\n",
        "<p>Log off of any sites on public computers.  As obvious as it may seem, the number of computers in the Apple store or even my school where computers are left logged into Facebook or Google is unbelievable.  Leaving a public computer logged into a website leaves the door open for anyone to quickly destroy reputations and wreak complete havoc.  Even teachers will post to a students' Facebook if left logged into a classroom computer.\n</p>\n",
        "<p>One of the biggest and most easily avoided problems is phishing.  Phishing is the stealing of personal information by using emails or sites that impersonate legitimate websites.  Always check the origins of emails and the web addresses of sites before sharing any information.  However, due to the fact that most sites offer authorization through <i>other</i> sites, with services such as OpenID, Google logins and the like, it's even more difficult to distinguish phishing sites, so more care is necessary when surfing the Internet.  Worth noting is that Facebook apps are not innocent either.  Any secure site that uses https will have information about security and the site owner.\n</p>\n",
        "<p>Some of the most common security advice online is to use strong passphrases and as simple as it is, it's also some of the most ignored advice.  Though most sites ask for a \"password\" a \"passphrase\" also fills that place and can be easier to remember.  Make it something memorable (only to you), with punctuation, and security is improved from then.  Unfortunately, a strong password is also more difficult to type on a phone lacking a full keyboard, so it is easy to fall to the temptation of switching to an easier password.\n</p>\n",
        "<p>Twitter and Facebook both give their users the opportunity to log in to other services with their site logins rather than making a new account, which makes traversing the Internet easier, but also introduces another risk of phishing.  Be wary of giving services access to existing logins and keep track of those that have access as they can be one of the biggest annoyances.  Many services that allow you to \"Login with Twitter\" will post a tweet with a link to themselves, and likewise with Facebook.  Though mostly an annoyance, online reputations <i>do</i> matter, and <i>can</i> be destroyed, so it's more than important to keep track of the permissions of third party sites and applications.\n</p>\n",
        "<p>It's not difficult to stay secure online, but some of the simplest means of staying secure often go ignored.  With the Internet taking over our lives more and more, security needs to be more of a priority, especially as hacking is an extremely profitable business (you didn't think they did it for fun, did you?).  Keeping yourself secure also keeps friends more secure as it prevents phishing links from posting themselves in news feeds, for one thing.\n</p>\n"
    ],
    "title": "Easiest Ways to Stay Secure Online",
    "date": "April 21, 2011",
    "datestamp": "2011-04-21T22:11:00-05:00",
    "tags": "internet, safety, security"
}
