{
    "datestamp": "2011-07-17T19:07:00-05:00",
    "content": [
        "<p><a href=\"http://4.bp.blogspot.com/-8v5aoqOBNWw/SxrlAtuLQnI/AAAAAAAAAJA/nX2cWoA8VMU/s1600/facebook.png\" imageanchor=\"1\" style=\"clear: right; float: right; margin-bottom: 1em; margin-left: 1em;\"><img border=\"0\" height=\"200\" src=\"http://4.bp.blogspot.com/-8v5aoqOBNWw/SxrlAtuLQnI/AAAAAAAAAJA/nX2cWoA8VMU/s200/facebook.png\" width=\"200\" /></a></p>\n",
        "<p>Google and Facebook are both in the process of rolling out some changes to their interfaces; Google started soon after announcing Google+, and Facebook started just in time for everyone to log into Facebook at work Monday morning and be irritated about it.</p>\n",
        "<p>For Google, the new look is pretty slick and integrates Google+ features (for those using the service) across most of Google's products with a new upper bar.&nbsp; The rest of the services that the change has affected now sport a new layout that is much more consistent across Google that was a long time coming, particularly for Blogger, but doesn't change anything so significantly that anything is hard to find.&nbsp; The new upper bar provides slick integration with Google+ for those using it and is more noticeable for switching between services.&nbsp; So far changes have been rolled out to GMail via a preview theme, Calendar, Blogger in Draft, Search, the Help centre, YouTube, and the account page (accessible through Google+) that include a new colour scheme and in some cases, smaller logos.&nbsp; I haven't really heard any complaints about it and I don't have any myself.</p>\n",
        "<p>Facebook, however, introduced a new chat interface this weekend.&nbsp; The new interface moves the contact list into a sidebar, moving the options to minimize the list and change availability settings into a menu.&nbsp; Worse, it no longer shows only online friends- just a long list of those recently contacted, online or not, with a search at the bottom.&nbsp; The annoyance resulting from this change has been amazing, at least within my group of friends, and understandably given that it makes the chat more annoying to use.&nbsp; As someone who usually takes Facebook's occasional changes in stride without any issues, I found the new chat interface extremely annoying, mainly because in the attempt at simplifying it, the interface made all the features harder to use.&nbsp; The big question becomes whether or not Facebook will listen to user feedback in light of their competition with Google+.&nbsp; If not...several of my friends have mentioned moving to Google+, so it will be interesting to see where it goes over the course of the week.</p>\n"
    ],
    "date": "July 17, 2011",
    "title": "Google and Facebook's New Looks",
    "tags": "facebook, google, social networking"
}