{
    "datestamp": "2012-02-22T00:46:00-05:00",
    "content": [
        "<p><a href=\"http://4.bp.blogspot.com/-rq_IA3YMoyk/Sxriplrf9lI/AAAAAAAAAI8/V514qRUDkoo/s1600/google.jpg\" imageanchor=\"1\" style=\"clear: right; float: right; margin-bottom: 1em; margin-left: 1em;\"><img border=\"0\" height=\"161\" src=\"http://4.bp.blogspot.com/-rq_IA3YMoyk/Sxriplrf9lI/AAAAAAAAAI8/V514qRUDkoo/s200/google.jpg\" width=\"200\" /></a></p>\n",
        "<p>Google has been drawing a lot of attention to itself over privacy issues, from a new privacy policy, to offering users the option to essentially sell their privacy.&nbsp; The new privacy policy goes live as of March 1st, if everything goes as Google plans and although the reaction to it is almost entirely negative, I don't find it particularly surprising.&nbsp; According to Google it is intended to unify all its services more, rather than maintaining a privacy policy for each individual service, which makes sense.</p>\n",
        "<p>At about the same time, Google unleashed a much quieter offering that essentially pays users to give up their privacy so that they can be monitored and so Google can \"learn more about its users to enhance its services.\"&nbsp; This offering gives users the option to be paid a total of $25 in instalments for running a browser extension to track them online, or significantly more if they allow Google to install a piece of hardware on their network that tracks <i>everything</i>.&nbsp; Although this is voluntary, it is a vast departure from Google's motto of \"do no evil,\" and has understandably been met with significant disapproval.&nbsp; Google's goals for this research may be to improve their services, but it is nothing short of invasive and an extreme violation of privacy and it is difficult to see why it is necessary given Google's huge ability to track people online as it is.&nbsp; As a Google user, I have a personal problem with using their services if they intend to improve them by removing the people's privacy entirely, no matter how voluntarily it may have been given up.</p>\n",
        "<p>Google has had a bad few months with privacy issues as it is, but its week has taken another downward turn with regards to how it tracks users.&nbsp; Generally, companies that reach even half of Google's size make headlines if they are penetrated by hackers. Even Google has had issues in the past with cross-site scripting to steal Google Apps domains and other information.&nbsp; This time around, it appears to be Google doing the hacking.&nbsp; Earlier this week, Google and a few other advertising companies were caught using workarounds to bypass the privacy controls of Apple's Safari web browser in order to track users and serve ads.&nbsp; Not long after, Microsoft accused Google of doing the same with Internet Explorer.&nbsp; This is not only an unquestionable violation of privacy, but a violation of Internet standards as well, which is unlike Google considering their status as a web company.</p>\n",
        "<p>Unfortunately, given how widely Google is used- they serve ads across the Internet along with other advertisers, there is no good way to escape any of this, other than turning off cookies, turning off Javascript, and installing browser extensions such as Ghostery to block tracking (even I use their tracking service to monitor my blog, a choice I am reconsidering).&nbsp; Given Google's control over the Internet, these privacy and standard violations impact a much wider audience than just Google users.&nbsp; Officially, it seems that nothing can be kept secret from Google anymore no matter who you are and what services you use.&nbsp; It is well known that the Internet provides very little, if any privacy at all, and with a company as pervasive as Google working to bypass what little privacy control web users have, the Internet becomes a very scary place.</p>\n"
    ],
    "tags": "google, internet, privacy, safety, world",
    "date": "February 22, 2012",
    "title": "Google's Latest Privacy Woes"
}