{
    "datestamp": "2012-02-28T02:21:00-05:00",
    "content": [
        "<p><a href=\"http://3.bp.blogspot.com/-rZ1WhaRldJk/T0x_k3Sn_0I/AAAAAAAAB0Q/QvU41pkLYSw/s1600/favicon.png\" imageanchor=\"1\" style=\"clear: right; float: right; margin-bottom: 1em; margin-left: 1em;\"><img border=\"0\" height=\"200\" src=\"http://3.bp.blogspot.com/-rZ1WhaRldJk/T0x_k3Sn_0I/AAAAAAAAB0Q/QvU41pkLYSw/s200/favicon.png\" width=\"200\" /></a></p>\n",
        "<p><i>The Philosophy of Nate</i> has lived on a Blogger subdomain ever since I first started it as a non-public blog. Since then it has gone through a number of changes and eventually evolved into the globally syndicated blog that it is now.</p>\n",
        "<p>At this point in time it seems appropriate that <i>The Philosophy of Nate</i> should move to its own web address and fully become its own online entity.&nbsp; I actually made the switch from a Blogger domain a few weeks ago, for anyone who noticed, but now it's time to make the official announcement!&nbsp; For the time being, the old address, natesphilosophy.blogspot.com, will still get you here without any trouble.&nbsp; However, the shiny new address is blog.thenaterhood.com so be sure to update your bookmarks.</p>\n",
        "<p>This also means a change in the email address that all you email subscribers receive mail from, which is currently my private mailbox.&nbsp; Starting next week you'll see mail from our shiny new email address, blog [at] thenaterhood.com. Make sure to update your email settings so that email from <i>The Philosophy of Nate</i> doesn't get marked as spam. <b>There will be no changes to the email subscription service other than the address.</b></p>\n",
        "<p>As always, happy reading! New to <i>The Philosophy of Nate?</i><b> </b>Welcome! You might want to go grab our feed or subscribe by email over in the sidebar so you don't miss anything good.</p>\n"
    ],
    "tags": "untagged",
    "title": "Some Blog News",
    "date": "February 28, 2012"
}