{
    "title": "The Internet Speaks Up About SOPA",
    "content": [
        "<p><a href=\"http://3.bp.blogspot.com/-iEGeh0ac17A/TxZegnTbo4I/AAAAAAAABy4/qubVc2DWFOI/s1600/censored.jpg\" imageanchor=\"1\" style=\"clear: right; float: right; margin-bottom: 1em; margin-left: 1em;\"><img border=\"0\" height=\"173\" src=\"http://3.bp.blogspot.com/-iEGeh0ac17A/TxZegnTbo4I/AAAAAAAABy4/qubVc2DWFOI/s200/censored.jpg\" width=\"200\" /></a></p>\n",
        "<p>Anyone looking to quickly look something up on Wikipedia, flip through Reddit, or grab a quick read from the front page of Wordpress today will be sorely disappointed.&nbsp; Those, among with many other sites are currently working to educate users about the dangers that SOPA and PIPA would bring if passed.</p>\n",
        "<p>On the surface, the two bills are looking to solve the huge issue of Internet piracy.&nbsp; However, much removed from that, the ramifications of them would be felt globally, destroying an open Internet all around the world.&nbsp; Both bills have one thing in common: censorship.&nbsp; They would permit the U.S government to take down any website - and by take down I mean take down and make it completely non-existent in the U.S - on small copyright claims.&nbsp; Both bills have support from the MPAA as well as other huge corporations who are willing to pay for senators to vote in favour of it.</p>\n",
        "<p>SOPA/PIPA (Stop Online Privacy Act and Protect IP Act) will be voted on on January 24th, 2012.&nbsp; If passed, they would allow the U.S. to censor the Internet, pave the way for other countries to pass similar laws, and destroy the security and neutrality of the Internet.&nbsp; If passed, the world as we know it could end in 2012, just as the Mayan calendar predicts.&nbsp; Call, email, or send a letter to your senator and make sure they know you oppose SOPA/PIPA to keep the Internet an open place and to preserve freedom of speech around the world.</p>\n",
        "<p>This is big enough that Wikipedia, Reddit, Cheezburger, and other huge online presences are willing to go dark for it, and others considered doing the same (Google, Amazon, Microsoft...).&nbsp; This is a big deal- speak up and don't let the Internet go dark.</p>\n",
        "<p>More information about these acts:</p>\n",
        "<p><a href=\"https://www.google.com/landing/takeaction/\">https://www.google.com/landing/takeaction/</a></p>\n",
        "<p><a href=\"http://en.wikipedia.org/wiki/Wikipedia:SOPA_initiative/Learn_more\">http://en.wikipedia.org/wiki/Wikipedia:SOPA_initiative/Learn_more</a></p>\n",
        "<p><a href=\"https://docs.google.com/spreadsheet/ccc?key=0AmGJz_37ojoqdFZhYlBhN2hQOGRoN2R0ZGh3VDZlblE&amp;pli=1#gid=0\">List of SOPA Supporters</a></p>\n"
    ],
    "date": "January 18, 2012",
    "datestamp": "2012-01-18T00:56:00-05:00",
    "tags": "internet, world"
}