{
    "content": [
        "<p><a href=\"http://3.bp.blogspot.com/-fPg3rgwmR9o/UISkad7c0nI/AAAAAAAAB6o/qpwyf7G1tyU/s1600/windows-new-logo-thumb-550xauto-84054.jpg\" imageanchor=\"1\" style=\"clear: right; float: right; margin-bottom: 1em; margin-left: 1em;\"><img border=\"0\" height=\"230\" src=\"http://3.bp.blogspot.com/-fPg3rgwmR9o/UISkad7c0nI/AAAAAAAAB6o/qpwyf7G1tyU/s320/windows-new-logo-thumb-550xauto-84054.jpg\" width=\"320\" /></a></p>\n",
        "<p>The official release of Windows 8 is later this week on the 26th, so the wait for the final reaction to the new version of Windows is finally less than a week away.  As far as the Internet has been concerned since screenshots of 8 first came out, the new Metro interface is everything from amazing to unusable, although the unusable claims seem to be the most widespread, if not just the most vocal.  For those like myself who are at a school that has access to MSDNAA, we've had access to the Windows 8 release since the beginning of the month for those who are curious enough to try it or in some cases, courageous enough to ditch Windows 7 in favour of Windows 8.</p>\n",
        "<p>I upgraded my laptop to 8 a few weeks ago after some consideration about compatibility and the effect that upgrading would have on my Linux install on the other half of my drive.  As far as the release goes, not a lot has changed visibly since the consumer preview that I tried previously in a virtual machine.  The same big things are the same big things; the classic Start menu is gone, replaced by Metro, Apps can be purchased from the new Windows Store, and the Desktop is no longer the jumping off point.</p>\n",
        "<p>As far as upgrading went, there weren't any problems.  After backing up all my files from both sections of my drive, I ran the upgrade from inside Windows and chose to keep my files but do a clean install of Windows.  The whole process took about 15 minutes, while I sat in the engineering lounge between classes, and as soon as it was done I was up and running.  The only problem that I had was finding and installing the UltraNav drivers from Lenovo in order to get my trackpad multitouch features to work.  I'll note at this point that I'm on a laptop and I do not have a touchscreen, which hasn't been a problem at all as far as getting around Metro is concerned.  Over the course of the day I ran through installing all the software I use, taking the opportunity to ditch everything I don't use, and didn't have any problems with compatibility which had been one of my first concerns with the upgrade.  Probably due to the fact that I upgraded from inside Windows, my Linux install, including GRUB, were left untouched, which was my other big concern.</p>\n",
        "<p>It took about a day to get used to having Metro as my main way of getting around my PC since things were in new places and now that I was using a physical install rather than a VM I had multitouch and some gesture support in order to get to things.  After the first day of getting used to Metro, I find that Metro is pretty awesome, as much as the rest of the Internet would vehemently disagree.  Flipping between the desktop and Metro apps is fluid and fast, something that I demand as a student and a developer since I spend a lot of time flipping from my code or project to messenger, email, and other things pretty frequently.  Finding apps is no different from any other version of Windows, finding an app just requires hitting the start key and typing a few letters of the name to filter it out and search also has the option of pulling up items from within other apps such as the store, contacts, email, or any other installed app that supports search.</p>\n",
        "<p>One of the biggest (and one of the most awesome besides Metro) improvements to 8 is power management.  Under Windows 7, I was lucky to get about 2 to 2.5 hours worth of battery life, which was enough to basically get me through one of my classes without plugging in.  Linux gave me a little more.  Windows 8 absolutely blows 7 (and right now, Linux as well) away as far as my battery life goes.  Under 8, I get about double the life I had before, at about 4.5 to 5 hours of battery, which for me is basically the difference between having to plug in every class and not needing to pull out my charger during the day, which is pretty amazing.</p>\n",
        "<p>As I've mentioned before, I like my Linux and I'm not generally a big fan of Microsoft, but after spending a few weeks with Windows 8 I can honestly say that I really like it.  For all the hate that Metro is getting all over the Internet, it seems like it's a lot of people who haven't spent the time to get used to it (because I won't lie, it does take a little time to get accustomed to but it's really not hard to use) or who just want to hate Microsoft for changing something.  As far as I'm concerned, everything works, it's faster, power management is a massive improvement, and Metro is a big step forward even on a non-touch laptop such as mine, so the upgrade was definitely worth the time.  For anyone looking to grab a copy of Windows 8, Windows 8 Pro is available for pre-order with some pretty nice discounts.  <a href=\"http://gan.doubleclick.net/gan_click?lid=41000000005217789&amp;pid=23487013&amp;adurl=http%3A%2F%2Fwww.officemax.com%2Ftechnology%2Fsoftware%2Fwindows-8-software%2Fproduct-prod4260960%3Fcm_mmc%3DPerformics-_-Technology-_-Software-_-Windows%25208%2520Software%26ci_src%3D14110944%26ci_sku%3D23487013&amp;usg=AFHzDLsUGEMk7Ocqac2Yq6p70phZ4UbFYg&amp;pubid=588304\" rel=\"nofollow\">OfficeMax has Windows 8 Pro for 65% off.</a></p>\n"
    ],
    "datestamp": "2012-10-22T11:00:00-05:00",
    "title": "The Upgrade to Windows 8",
    "date": "October 10, 2012",
    "tags": "microsoft, review, tech, windows"
}