{
    "title": "Learning from Apple Maps",
    "content": [
        "<p><a href=\"http://2.bp.blogspot.com/-i0470oLaqPI/UGYUKPDh8UI/AAAAAAAAB6E/lbPK7zBJgQ0/s1600/silver-apple-logo.png\" imageanchor=\"1\" style=\"clear: right; float: right; margin-bottom: 1em; margin-left: 1em;\"><img border=\"0\" src=\"http://2.bp.blogspot.com/-i0470oLaqPI/UGYUKPDh8UI/AAAAAAAAB6E/lbPK7zBJgQ0/s1600/silver-apple-logo.png\" /></a></p>\n",
        "<p>Apple has been in the news a lot over the past several weeks with their patent suit against Samsung and the release of iOS 6, and is now in the middle of cleaning up their own mistakes with the new iOS.  It has been rumored for a while that Apple would replace Google Maps and YouTube with their own equivalents since Apple and Google are competitors in the smartphone market, so the fact that iOS 6 has Apple Maps as the default maps app and is missing the YouTube app doesn't come as a surprise.  What is surprising, however, is how bad Apple Maps actually is.  I'm not a fan of Apple by any means, but I have always been able to give them credit for making sure all of their product releases are up to their usual standards.  With Apple Maps, that just hasn't been the case.  Apple has been met with round after round of complaints over wrongly named countries, weird 3D imagery of melting cars, and outdated maps.</p>\n",
        "<p>While Apple can't be blamed for wanting to ditch apps from Google, and some of the blame can be directed at TomTom, the company Apple licensed map information from,  Apple clearly made a bad decision on behalf of its users.  In their credit, Apple has at least handled the situation fairly well after they realized that it wasn't going to go away.  Tim Cook issued a formal apology to iOS 6 users last week amid promises that the app would be improved and updated, which is the first from him in the various other issues Apple has issued apologies for, and Apple is now pushing a list of alternative map applications in the app store.  With that, Apple seems to have re-learned that quality of product is more important than knocking out their competitors, which is something that Steve Jobs taught Apple when he took charge.</p>\n",
        "<p>The mistake that Apple made with their maps application is the type of mistake that seems to be becoming increasingly likely as more companies start pushing their own apps.  Microsoft now has their store with Windows 8 Certified Apps, Android has its marketplace, Apple has the app store, and other companies are starting to build their own places for buying apps.  The problem that arises is when app developers prioritize pushing their in-house products that may or may not be well-developed and pushing out the ones that are competing, but possibly better.  Once this starts happening, users no longer have as much of a choice as the companies behind their devices are essentially deciding what apps they should use for them.  Microsoft got in trouble for doing this with Internet Explorer in the EU but it seems that with other things, nobody really cares and the only thing users can do is complain about problems and hope they get fixed.  What's worse is the fanboys of any platform (yes, that also means Linux users, I was there once too) won't see any problem with their own platform until it's too late.</p>\n"
    ],
    "date": "October 2, 2012",
    "tags": "apple, computer, news",
    "datestamp": "2012-10-02T02:14:00-05:00"
}