{
    "tags": "computer, microsoft, review, tech, windows",
    "datestamp": "2012-06-20T01:54:00-05:00",
    "title": "Why the Hate for Windows 8?",
    "date": "June 20, 2012",
    "content": [
        "<p><a href=\"http://2.bp.blogspot.com/-iyZ2JfxFCBw/T-FiLFbU22I/AAAAAAAAB44/OT32ihec2T8/s1600/start_screen.png\" imageanchor=\"1\" style=\"clear: right; float: right; margin-bottom: 1em; margin-left: 1em;\"><img border=\"0\" height=\"240\" src=\"http://2.bp.blogspot.com/-iyZ2JfxFCBw/T-FiLFbU22I/AAAAAAAAB44/OT32ihec2T8/s320/start_screen.png\" width=\"320\" /></a></p>\n",
        "<p>At this point, the new interface for Windows 8 is old news, with two preview releases out and the screenshots all over the Internet.&nbsp; To boil it down briefly, the iconic Start menu and button is gone, and has been replaced with the Metro Start Screen, which serves more or less the same purpose.&nbsp; The Start Screen is more customizable and is the new place for everything installed on Windows 8, which can include apps from Microsoft's own store.&nbsp; Additionally, the old \"desktop\" is now part of the tiles on the Start Screen since it is no longer intended to be the starting point, which takes a little getting used to.&nbsp; Other things, such as settings, are moved around a little and take some searching to find, since panels like the Charms menu pop up when the cursor is in the corner of the screen.</p>\n",
        "<p>For some reason, the new interface has been the subject of a lot of hate across the Internet.&nbsp; The focus is generally on getting the start menu back, which isn't possible on anything newer than the consumer preview.&nbsp; I understand that the Start menu has been part of Windows for long enough that everyone expects it to be there, so there is some resistance to changing it.&nbsp; Personally, I like the new Start Screen, which is really saying something considering my opinions of where some of the Linux desktop environments have gone, such as GNOME 3 and Unity.&nbsp; I moved away from Ubuntu to avoid Unity, and I switched to XFCE from GNOME because GNOME 3 did not work for how I use my computer.&nbsp; The Start Screen in Windows 8 allows for much more customization with where applications are placed in it and the search is snappy.&nbsp; The lack of a Start menu took a little getting used to at the beginning, but having used Windows 8 for long enough to have gotten used to it, it is definitely much faster to use.</p>\n",
        "<p>With that said, Windows 8 is much nicer under the hood than 7, which is the latest I can compare it to.&nbsp; I installed 8 on a severely underpowered virtual machine because my laptop only has so many resources I can use, and it feels like it runs better than my physical Windows 7 machine on the other side of my drive.&nbsp; On a VM with the same specs (1.3 gigs of RAM, 1 x 2.3GHz CPU), Windows 7 is almost unusable when anything more than one program is running at a time.&nbsp; I was impressed at how well Windows 8 ran, though for the consumer preview I had to disable Secure Boot for the system to run in my VM.</p>\n",
        "<p>My honest opinion of Windows 8 is that it's actually pretty good.&nbsp; It does take a little getting used to to be sure, considering it is a hybrid desktop/tablet interface, but it isn't terribly difficult to learn.&nbsp; There is a bit of a divide between Metro apps (full-screen apps that don't run on the desktop), and desktop apps but I found that it wasn't all that bad.&nbsp; Metro looks nice, runs well, and is nice to use.&nbsp; I do worry that some third-party apps will clutter up Metro by taking a departure from the style Microsoft is trying to set, but when it's all said and done that's really not a major problem.&nbsp; My operating system preference has been a Linux distro for a long time now and I've avoided Windows because let's be honest, the command line sucks, and it can feel bloated.&nbsp; Windows 8 is different and I can definitely see it as a companion to Linux on my system rather than \"that huge drive partition that I use to run Steam and AutoCAD.\"&nbsp; The only real qualm that I have with Windows 8 is Secure Boot, because though I don't have a problem with Windows 8, I do have a problem with not being able to boot my computer into whatever I feel like booting it into, be it Linux, Windows, OS X, Solaris, Nyan Cat, or whatever else.&nbsp; Secure Boot worries me and I've discussed it before, but what happens with that is up to hardware manufacturers more than Microsoft at this point.</p>\n"
    ]
}