{
    "tags": "microsoft, windows",
    "title": "Windows 8, Two Months Later",
    "datestamp": "2012-12-18T07:25:00-05:00",
    "content": [
        "<p><a href=\"http://2.bp.blogspot.com/-iyZ2JfxFCBw/T-FiLFbU22I/AAAAAAAAB44/OT32ihec2T8/s1600/start_screen.png\" style=\"clear: right; float: right; margin-bottom: 1em; margin-left: 1em;\"><img alt=\"Windows 8 Start Screen\" height=\"150\" src=\"http://2.bp.blogspot.com/-iyZ2JfxFCBw/T-FiLFbU22I/AAAAAAAAB44/OT32ihec2T8/s200/start_screen.png\" width=\"200\" /></a></p>\n",
        "<p>About two months has passed since I upgraded my laptop to Windows 8 back in October, slightly before the public release. Despite my general preference for Linux, my initial impressions of 8 were really good and for the most part, that still stands after using the OS after the initial shininess has worn off and I've broken it in a little more.  With that said, Windows 8 is still very definitely a Windows operating system with the same quirks here and there as before, although I still maintain that it is an improvement over 7.</p>\n",
        "<p>As has been typical with Windows since as long as I can remember (I go back to Windows 95 myself), 8 takes a while to get to a point where it's usable after logging in.  I don't have a ton of programs start at login and I've disabled most of the ones that have a higher impact (according to Task Manager), and I still have plenty of time to get up and get a snack between logging in and having a usable desktop.  Once the system is up, it's still snappy even with my OS-killing collection of applications that I keep open, which include Firefox, Steam, Eclipse, Rainmeter, and a number of other things that I forget to close or leave up in the background, including Metro applications.  Particularly with so many things running most of the time, I still find it impressive how fast Windows is able to resume after hibernating, which it will do automatically if suspended for a long time.  Back on Windows 7, hibernating on my laptop was not usable because it took the system longer to come back from that than it did to boot, which hasn't been the case with 8.</p>\n",
        "<p>Battery life remains basically unchanged, as I mentioned previously it still far surpasses Windows 7 by at least 2 hours at any given time.  I have the generally bad habit of running my battery into the ground on a pretty regular basis while I try to crank out a few more lines of code before running to dinner, so I can attest to the fact that Windows hasn't been lying to me when it claims I have 4 or more hours of battery left.</p>\n",
        "<p>At one point I had a weird instance of my antivirus (Avast!) breaking a few Metro apps, which I've seen happen to other people as well.  Avast! doesn't take terribly kindly to Metro apps at times, particularly if it was pulled through the upgrade.  I opted to keep only my files while upgrading, so Avast! was a clean install and still had a problem.  I had no problems with it until one day when I pulled up my computer and couldn't use anything Metro, Avast! complained every time.  I don't remember how I finally resolved it, but I ended up needing to uninstall and reinstall a few tiles that ended up broken as a result.  Although this was more likely to be a problem with Avast! than it was Windows, it does show that Windows 7 software won't always play nicely with Windows 8.  The problem hasn't happened again so with any luck it was just a one-time thing.</p>\n",
        "<p>Despite my best efforts to install and reinstall drivers, Windows doesn't play well with my bluetooth.  In Windows 7 I was able to stream music to my speakers from my phone via bluetooth and send files back and forth most of the time, but 8 either no longer has the capability (which I doubt) or it simply doesn't work.  Fortunately, I don't rely on using bluetooth in Windows terribly often, but the problem is still annoying because it was a feature I used, and for some people might be a much bigger problem.</p>\n",
        "<p>Finally, the most annoying thing:  Windows 8 will throw you into the start screen whether or not you actually want to go there when you press the Windows key.  More than once while gaming I've hit the Windows key and been thrown to the start screen, which never makes me particularly happy if I was getting attacked by a mob of headcrabs in Half Life 2.  I've found that most of the time, games don't take kindly to being interrupted, and have to be forcibly closed afterwards.  Windows 7 did the same thing, but opening the start menu was more along the lines of hitting alt+tab, rather than 8 which puts more emphasis on getting to the start screen than anything else.</p>\n",
        "<p>To sum it up:  Windows 8 is still Windows under the hood and suffers from a lot of the same problems and quirks.  It is a big improvement over 7 in terms of performance which still makes the upgrade worthwhile.  Getting used to the new Metro start screen took all of a day and feels much smoother than the start menu from older windows versions, which is another thing in Microsoft's favor as they push Metro out to all of their other devices as well.</p>\n"
    ],
    "date": "December 18, 2012"
}