{
    "title": "Platform vs. Platform",
    "content": [
        "<p><a href=\"http://4.bp.blogspot.com/-vX6V_txsAEA/Tidaa0IT88I/AAAAAAAAAe4/h4RTyjeJE9Q/s1600/sit3-shine.7.gif\" imageanchor=\"1\" style=\"clear: right; float: right; margin-bottom: 1em; margin-left: 1em;\"><img border=\"0\" height=\"200\" src=\"http://4.bp.blogspot.com/-vX6V_txsAEA/Tidaa0IT88I/AAAAAAAAAe4/h4RTyjeJE9Q/s200/sit3-shine.7.gif\" width=\"181\" /></a></p>\n",
        "<p>One of the most interesting things about the digital world is the availability of the cloud.&nbsp; Pretty much everything is capable of going online in some way or another and accessing cloud services as either a mobile or \"desktop\" device.&nbsp; The coolest part of it is it no longer really matters what platform is being used behind the scenes on the client device.&nbsp; So much effort and money goes into advertising why one platform is better than another- Windows vs Mac OS X, Android vs Windows Phone vs iOS even though for the majority of people it doesn't actually make a lot of difference.</p>\n",
        "<p>Most of my files are stored in one cloud service or another, I use webmail, and I have Internet access almost anywhere I go.&nbsp; I can pull out almost any device and start using it with all of my stuff at my fingertips.&nbsp; I've used iPads, Kindles, borrowed computers, and I have an Android phone, Linux, Windows, and a Palm Pilot (yep, I'm old-school).&nbsp; In all cases for getting online and accessing my stuff, it really makes very little difference which platform I'm on or even that it's actually mine.&nbsp; I'll probably get ostracized from the Linux community for saying this, but since I've ported most of the software I've built to run on both Windows and Linux, I no longer care that much which of the two systems I'm in.&nbsp; I have a dual-boot setup on my laptop with 7 and Arch Linux and lately I've been spending more time on the Windows side of things than the Linux side.&nbsp; My main preference for Linux is that I can go and get my hands dirty much more easily than with other systems, and it used to also be that that was where my software ran.</p>\n",
        "<p>The point is, the operating system wars and total hate for other platforms is starting to get a little obsolete for any heavy user of the cloud.&nbsp; Admittedly, I rather dislike Mac OS X and iOS, but for most people we're almost at the point where they can choose their platform based on looks; everything else is online.&nbsp; I already don't have a huge preference for web browsers, I use Firefox mainly because it runs on all my stuff and it happens to be where all of my preferences are.&nbsp; Operating systems are heading in the same direction.&nbsp; Windows 8 syncs user settings, bookmarks (in IE), and Windows Store apps to Windows Live and pulls them down anytime you sign into a Windows 8 computer or phone with a Windows Live ID.&nbsp; Apple does the same with iCloud, Ubuntu has Ubuntu One, and Linux in general makes it very easy to sync your home directory to the cloud service of your choosing, including your own.&nbsp; Chromebooks, though not a raging success by any means, are Google's attempt at rolling their own as well as an entirely cloud-centric OS.</p>\n",
        "<p>Speaking as a Linux fan and a developer, I don't have a huge preference between Linux and Windows any more.&nbsp; Both have things that annoy me, but all of my software (homebrew and downloaded) runs on either system, my files are on both, and everything else is pretty similar.&nbsp; They look the same and the terminal will even accept (I've done a little hacking on the Windows side to make this work) the same commands.&nbsp; The underlying platform just doesn't make a huge difference to me and to someone less technologically inclined, probably wouldn't matter at all.&nbsp; Unless it's Apple.&nbsp; I can't stand Apple's software.</p>\n"
    ],
    "date": "July 7, 2012",
    "datestamp": "2012-07-17T00:30:00-05:00",
    "tags": "computer, linux, microsoft, mobile, windows"
}