{
    "date": "April 11, 2013",
    "title": "Saying Goodbye to a Dinosaur (Windows XP)",
    "datestamp": "2013-04-11T16:11:25-05:00",
    "content": [
        "<p><a href=\"http://3.bp.blogspot.com/-fPg3rgwmR9o/UISkad7c0nI/AAAAAAAAB6o/qpwyf7G1tyU/s1600/windows-new-logo-thumb-550xauto-84054.jpg\" imageanchor=\"1\" style=\"clear: right; float: right; margin-bottom: 1em; margin-left: 1em;\"><img border=\"0\" height=\"230\" src=\"http://3.bp.blogspot.com/-fPg3rgwmR9o/UISkad7c0nI/AAAAAAAAB6o/qpwyf7G1tyU/s320/windows-new-logo-thumb-550xauto-84054.jpg\" width=\"320\" /></a>\n</p>\n",
        "<p>Forescore and 12 years ago in 2001, Microsoft announced the release of Windows XP. Windows XP was the best version of Windows to that point and a way of forgetting Windows ME, which we don't speak of. In a lot of senses, Windows XP is still a fairly rock solid operating system which is pretty impressive for how old it is, almost 12 years. Twelve years and 3 versions of Windows later, 38% of Internet users are still trying to hang on to XP. \n</p>\n",
        "<p>According to Microsoft, it's time to upgrade as support for XP ends 362 days from now, on April 8, 2014. For those who use XP because they prefer its interface over Vista onwards or who simply can't afford to upgrade, that's a scary thought. Once support expires, that's 38% of Internet users who are now at more of the mercy of the Internet. To be fair, your computer isn't going to spontaneously combust when support expires, but with no more patches to fix security holes, antivirus can only do so much to keep you and your data safe (so it may burst into flames later on).\n</p>\n",
        "<p>Microsoft has unsurprisingly been pushing XP out for a while at this point with campaigns to upgrade Internet Explorer (but if you have XP, not past 8!) and actually not supporting XP anymore for a number of their software offerings. Although a lot of large software providers still support the old operating system, once Microsoft's support ends that could very well change despite how well-liked it still is. For now, XP is still fairly viable but it's pretty much fair game in either direction come April 2014.\n</p>\n",
        "<p>So, for those who are caught up in the mix, there's a few options. Staying with XP is a possibility but definitely not the best choice in the long run. Although most major pieces of software will still run on XP at least for now, it's only a matter of time before companies move on after formal support is up. For those who want or need to stick with Windows, 7 is probably the best option considering how disliked 8 seems to be. In my opinion, the hate for Windows 8, though catchy to say, seems incredibly misplaced, but to each their own. Grabbing a new version of Windows will probably set you back about $100, since Windows isn't exactly inexpensive. For those feeling a little more adventurous there's also Linux, which is free and will almost definitely run on your hardware, in addition to coming with whatever interface you could ever care for. For those considering a Linux distribution, Linux Mint would probably be a good place to start since Ubuntu is starting to go in a weird direction, but a little searching will turn up anything you might be interested in. Since it's free, it's entirely within your power to experiment with different distributions and to play around to get what you want. Mac OS is another option, but will set you back substantially more.\n</p>\n",
        "<p>Regardless of what you choose, make sure to make an educated decision and bunker down or get settled somewhere else come April 2014.\n</p>\n"
    ],
    "tags": "windows, microsoft, computer"
}