{
    "date": "February 5, 2013",
    "content": [
        "<p><a href=\"http://4.bp.blogspot.com/-8v5aoqOBNWw/SxrlAtuLQnI/AAAAAAAAAJA/nX2cWoA8VMU/s1600/facebook.png\" imageanchor=\"1\" style=\"clear: right; float: right; margin-bottom: 1em; margin-left: 1em;\"><img border=\"0\" height=\"200\" src=\"http://4.bp.blogspot.com/-8v5aoqOBNWw/SxrlAtuLQnI/AAAAAAAAAJA/nX2cWoA8VMU/s200/facebook.png\" width=\"200\" /></a>\n</p>\n",
        "<p>Facebook has released a new feature - and with it, a new layout - called Facebook Graph Search to people who signed up for the beta.  I'll admit that I haven't gotten access yet, but I have had time to check it out via friends and the Internet.  From what I've seen, it is the coolest, creepiest feature Facebook could have added.  On one hand, it is a pretty cool search tool that lets you search for friends based on interests, associations, or whatever using a more or less natural language search.  On the other, it gives Facebook a whole new status as a powerful stalking tool if you want to get to know people.  One of the more amusing searches that I found online was \"Married friends who like prostitutes\" which would, as expected, return a list of friends who are married and who also \"like\" prostitutes.  The search also allows you to branch out to non-friends by searching criteria for \"friends of friends.\"  It seems that in general, searching for \"Pictures of friends of my friends\" returns a page of pictures of people that you probably don't know, for example.  The main use for this I can see is organizing friends into groups based on their interests or beliefs if you somehow feel that that's important, finding all your friends who like Linux so you can get tech support, or finding new places to go.  Outside of that, it seems to be more of a stalker tool than anything else.\n</p>\n",
        "<p>My first thought when I saw Graph Search was \"ugh, well now I need to go and check all my privacy settings again,\" even though I keep a close eye on what I share (not much, but even so) already.  Unfortunately, Facebook doesn't allow you to hide things from graph search once they've been posted so even if something is hidden from your timeline, it can still be found through graph search.  Additionally, Facebook announced that they are removing the option to hide from Facebook's public search since too small a percentage of their users actually use the feature.  According to the announcement, only a single-digit percentage of users use the option, which corresponds to millions of people considering the size of Facebook's userbase.  I opt out of public searches myself, though through Facebook's number of changes to their privacy interface, I can admit that I no longer have any idea where the option actually is.\n</p>\n",
        "<p>Hopefully Facebook gets privacy settings ramped up significantly more before Graph Search goes public amid everyone's upcoming complaints about the new top bar, but since Facebook makes it clear that they would rather have you set your profile to public than to actually use privacy settings, it could be some time before users get upset enough about old - and hidden, no less - posts popping up in search for Facebook to actually make any changes.  In Facebook's credit, the last I had seen Graph Search in action, it wasn't possible to search for friends based on where they had recently checked into, but that's a fairly small thing compared to the privacy implications at large.  Facebook appears to be replacing the main site search with Graph Search and making it impossible to avoid (the top bar is now a search bar and no longer has links to the homepage), so there really isn't any option to 'opt-out' of either using or showing up in Graph Search in any way.\n</p>\n",
        "<p>Until I get access to the beta, I'm not clear on how far-reaching graph searches are although seeing how broadly searches can be made, it probably doesn't have much in terms of limitations on what or who can be searched.  It's definitely a very powerful tool given the information Facebook has about its users at its disposal paired with natural language search and search predictions, but it's also incredibly creepy when you start considering how you can search for people.  Graph Search isn't limited to recent or even only visible timeline posts, so all those old, melodramatic posts from middle school are now easily findable again, along with everything else about you.  Cool, but very creepy and very stalkerish.  Facebook won't be the only one to delve into this sort of area either and actually isn't necessarily the first, when you consider that a number of services now offer natural language and learning search.  Google Now, for example learns about you and predicts what you want to know and via Google+, it wouldn't be a huge leap for Google to integrate that with its own, yet nonexistant variant of Graph Search.  You can read Facebook's introduction to Graph Search at <a href=\"https://www.facebook.com/about/graphsearch\">https://www.facebook.com/about/graphsearch</a>.\n</p>\n"
    ],
    "title": "Facebook Graph Search",
    "datestamp": "2013-02-05T14:45:00-05:00",
    "tags": "communications, facebook, privacy, social networking"
}