{
    "title": "Historically Searching...",
    "tags": "privacy, google, microsoft, security, personal, internet",
    "date": "May 16, 2013",
    "content": [
        "<p><a href=\"http://1.bp.blogspot.com/-PSTV5yZpLzM/SxrbdyL07KI/AAAAAAAAAIg/RpSaCqphs_Y/s1600/padlock.png\" imageanchor=\"1\" style=\"clear: right; float: right; margin-bottom: 1em; margin-left: 1em;\"><img border=\"0\" height=\"200\" src=\"http://1.bp.blogspot.com/-PSTV5yZpLzM/SxrbdyL07KI/AAAAAAAAAIg/RpSaCqphs_Y/s200/padlock.png\" width=\"200\" /></a>\n</p>\n",
        "<p>Digging through the data that the online services you use have stored (and available to you) is always an interesting endeavour. At this point, most people realize that no matter what websites you're signed up for, most, if not all of them store some amount of information about you. Some sites choose to tell you about the data they collect, and others even give you a nice log of everything from where you've logged in from to everything you've searched for. Generally, the reasoning behind keeping this data is that it allows services to show you more relevant ads and to customize your searches so that you'll only find the things you want to see. It's actually a very interesting exercise to make a new account on Google, for example, on a brand new browser and start searching for things. After a surprisingly short amount of time, Google stops showing you things that you disagree with.\n</p>\n",
        "<p>Microsoft and Google, both running search engines and having a fair amount of social network users at their disposal not to mention file storage, hold a massive amount of information about users. That fact isn't surprising, it comes with the territory of providing a large number of services to users that to a degree evolve around each user. Both companies customize search results and advertising around what their users do. Microsoft is actually the lesser evil here, because they don't index emails in order to provide the ads on their free email service, but they do keep tabs on what gets stored on their services. As we all know, if you upload data to any online storage, the company can have their systems take a look and target ads. What else do these services keep around? Not a lot of people consider that their searches hang around.\n</p>\n",
        "<p>It's an interesting exercise, particularly with Google, to go and take a look at your search history. Google gives you a nice panel of statistics about your searching as well as every search you've ever made while logged in. Bing allows you to look through your history but doesn't give you any statistics about it. My Google account has on record 19,031 searches since I created it in 2009. I can clearly pick out the blocks of time where I was learning a new programming language as well as what classes I was taking at the time, down to the time of day. The majority of my searches happen 4-8pm. The takeaway from this is that Google has on record 4 years worth of my online activity, and Bing has longer since that account is much older. Both allow you to clear your history, which they both recommend that you not do because it puts you back at square one for ads and suggestions, although it doesn't take very long to end up back in your search bubble. As someone who is security and privacy conscious, I'm not particularly fond of having my searches logged. If you agree, clear out your history regularly or use a search engine such as duckduckgo.com which doesn't log searches. No matter what your stance, it's important to keep in mind what and how much data gets stored about you as you go about your online life. I respect the fact that some people are conscious to the fact, which is why I offer the option to opt-out of being tracked across my site (privacy page if you're looking) to the degree that I have control over. Most sites just log everything and everyone.\n</p>\n",
        "<p>Useful Links:\n</p>\n",
        "<p>Google Search history: https://history.google.com/history\n</p>\n",
        "<p>Bing Search history: https://ssl.bing.com/profile/history</p>\n"
    ],
    "datestamp": "2013-05-16T00:56:19-05:00"
}