{
    "datestamp": "2013-03-18T22:07:15-05:00",
    "date": "March 18, 2013",
    "tags": "facebook, privacy, social networking",
    "content": [
        "<p><a href=\"http://4.bp.blogspot.com/-8v5aoqOBNWw/SxrlAtuLQnI/AAAAAAAAAJA/nX2cWoA8VMU/s1600/facebook.png\" imageanchor=\"1\" style=\"clear: right; float: right; margin-bottom: 1em; margin-left: 1em;\"><img border=\"0\" height=\"200\" src=\"http://4.bp.blogspot.com/-8v5aoqOBNWw/SxrlAtuLQnI/AAAAAAAAAJA/nX2cWoA8VMU/s200/facebook.png\" width=\"200\" /></a>\n</p>\n",
        "<p>When it comes to the Internet, it's always interesting to see how things evolve once they come about and sometimes, how they get contorted into very different things. Nearly everyone knows about or at the very least, has heard of the idea of 'liking' things on Facebook.  'Likes' started off as Facebook Fan Pages just a few years ago where brands, or anyone for that matter, could start a public Facebook page to promote themselves and form an interactive community.  In keeping with Facebook's (at the time) new 'like' button, the idea of becoming a fan of something was turned into \"Liking\" the page, in order to make interaction with Facebook more consistant and in their words \"more lightweight.\"  'Liking' brands, celebrities, and causes is now the new thing to do, and people click the like button as though their lives depend on it.  It does raise some awareness of certain causes, although given how many causes some people have listed in their likes, it seems like some people might actually buy into the \"For every like I'll donate to xx cause.\"  Granted, organizations with Facebook pages occasionally have actual posts like that on their page and do donate to causes, but the idea of 'liking' has actually gotten contorted in some really weird ways.\n</p>\n",
        "<p>Now that liking is just something that everybody does, it carries with it some interesting meanings for the person doing the liking.  A recent publication shows that what you like on Facebook actually carries some deeper meanings that you probably weren't aware of. Who knew that liking curly fries on Facebook could actually say something about who you are, other than your like of curly fries. The study that was published shows that the pages you like can predict your level of intelligence, sexuality, gender, religion, and political views correctly at least 60% of the time.  More specifically, looking at lists of the pages liked on Facebook without looking at the person provided enough insight to correctly predict male sexuality 88% of the time, whether the person was African-American or caucasian 95% of the time, and whether the person was Republican or Democrat 85% of the time.  Apparently, the majority of likes didn't specifically point to things - only ~5% of gay users 'liked' gay marriage, and those who were generally smarter tended to 'like' curly fries - but combined, these likes said a lot more about the person than they said at face value. Clearly, if you're applying to college you also should go and 'like' curly fries, just in case. That's not to discount the credibility of the study by any means seeing as they spent a lot of time crunching a ton of data to come up with these statistics, but it goes to show that 'liking' something isn't nearly as innocuous as it seems at face value. It's already apparent that Facebook targets ads in part because of what you 'like,' but this opens up a lot of potential new avenues for advertisers and anyone else who might want to know about you.\n</p>\n",
        "<p>Then, of course, comes the darker side of Facebook likes. One of the recent trends on Facebook is to put up pages for various causes or to post pictures saying \"like if you think...\" where basically everyone would agree and like the page. I see the posts scroll by in my news feed pretty frequently and I ignore them, but the reason I end up seeing them is because not all my friends do the same. Although there needs to be a little thought put into what you choose to 'like' because of what it says about you, a lot of people click 'like' because they agree, because it's there, or for a variety of other reasons because liking is fun. In actuality, the majority of these pages aren't actually legitimately representing what they claim to be. For every cause on Facebook there's basically one or a few legitimate pages, and the rest have very little to do with the cause other than the name. This becomes a problem because Facebook likes have become a commodity, so promoting any cause that would get a lot of 'likes' is actually profitable. Some of the less legitimate pages actually get auctioned off and are bid on based on the number of likes so that another brand can have a pre-made Facebook community (this works because renaming pages is really easy to do). There have been businesses selling 'likes' for a long time now, but selling actual pages is relatively new. It's really interesting to see how 'likes' - formerly 'becoming a fan' - have evolved into things that can be bought and sold.\n</p>\n",
        "<p>The main thing to take away is to be careful what you associate yourself with online, be it with 'likes' or following various Tumblr blogs or whatever else you like to do online. You never know when your 'like' of The Dark Knight (which tends to be liked by those with fewer Facebook friends) will come back to haunt you. Privacy settings are important, but they aren't the whole story seeing as next to nobody really pays attention to things like 'likes' that don't seem like a big deal. As was always the case, moderating what you do and follow online is the most important thing.\n</p>\n",
        "<p>More information:\n</p>\n",
        "<p>http://www.bbc.co.uk/news/technology-21699305\n</p>\n",
        "<p>http://healthland.time.com/2013/03/12/your-facebook-likes-may-be-more-revealing-than-you-think/\n</p>\n"
    ],
    "title": "Lovin' those Facebook Likes"
}