{
    "tags": "untagged",
    "title": "We're Moving!",
    "content": [
        "<p><a href=\"http://3.bp.blogspot.com/-rZ1WhaRldJk/T0x_k3Sn_0I/AAAAAAAAB0Q/QvU41pkLYSw/s1600/favicon.png\" imageanchor=\"1\" style=\"clear: right; float: right; margin-bottom: 1em; margin-left: 1em;\"><img border=\"0\" height=\"200\" src=\"http://3.bp.blogspot.com/-rZ1WhaRldJk/T0x_k3Sn_0I/AAAAAAAAB0Q/QvU41pkLYSw/s200/favicon.png\" width=\"200\" /></a>\n</p>\n",
        "<p>There's been some big changes in the works for The Philosophy of Nate for a few months now, and it's finally time to show them off. I've been working on developing my own platform to host The Philosophy of Nate in hopes of migrating the blog from Blogger to a new platform that's faster, cleaner, and especially, focuses on improving how readers such as yourselves interact with my blog. The new platform has substantially better integration with the rest of my website which allows me to make browsing more uniform and to expand options such as my website's \"do not track\" feature.\n</p>\n",
        "<p>I expect to make the switch sometime midweek. Everything is set up for the migration to be clean and simple so on your end, the blog gets a new look and some new options but otherwise should continue to work as it always has since all the web addresses will redirect. However, those who subscribe by any means may run into a few bumps with the feed switching over depending how FeedBurner handles the change. I apologize in advance for any extra feed notifications or emails (FeedBurner is configured to only send one email per 24 hours, so those getting emails will get at most 1 email). Comments and the commenting system will get pulled over a few days after the switch is made.\n</p>\n",
        "<p>If you're interested in taking a look at the new platform before the blog officially gets moved over or you want more information, visit <a href=\"http://www.thenaterhood.com/scratchandsniff\">http://www.thenaterhood.com/scratchandsniff</a>. Feedback is always welcome.\n</p>\n",
        "<p>Meanwhile, if you're new to The Philosophy of Nate, welcome! If you like what you see, consider subscribing to stay up to date.\n</p>\n",
        "<p><strong>Update: The migration is complete and everything appears to be working as it should.</strong></p>"
    ],
    "datestamp": "2013-02-24T00:04:05-05:00",
    "date": "February 24, 2013"
}
